Configuration Examples and TechNotes
Configure authorization policy based on vlan-id attribute on ISE
Save
Translations
Download
Print



Updated:November 25, 2021
Document ID:217586
Bias-Free Language
Contents
Introduction
Use case
Configuration steps
NAD side
ISE side
Test
NAD side
ISE side
Introduction
This article describes the steps to configure the ISE authorization policy based on the VLAN id attribute sent from the NAD. This feature is only available with IBNS 2.0.
Use case
Customers want to populate the VLAN ID that is configured on the access interface and later use it to provide access on ISE.
Configuration steps
NAD side
1. Configure the switch to send VLAN radius attributes in the access request.
Device# configure terminal
Device(config)# access-session attributes filter-list list TEST
Device(config-com-filter-list)# vlan-id
Device(config-com-filter-list)# exit
Device(config)# access-session accounting attributes filter-spec include list TEST
Device(config)# access-session authentication attributes filter-spec include list TEST
Device(config)# end
NOTE: You may get a warning when entering the "access-session accounting attributes filter-spec include list TEST" command to accept migrating to IBNS 2.
Switch(config)#access-session accounting attributes filter-spec include list TEST
This operation will permanently convert all relevant authentication commands to their CPL control-policy equivalents. As this conversion is irreversible and will disable the conversion CLI 'authentication display [legacy|new-style]', you are strongly advised to back up your current configuration before proceeding. 
Do you wish to continue? [yes]: 
Check the following guide for more details: Vlan-id radius attributes config guide
ISE side
1. Create an authentication policy based on your needs (MAB/DOT1X).
2. The authorization policy will include the next condition type, make sure to match the exact syntax
RadiusÂ·Tunnel-Private-Group-ID EQUALS (tag=1) <vlan ID>
Example:
For a VLAN-ID = 77
Test
NAD side
Switch#sh run interface Tw1/0/3 
Building configuration...

Current configuration : 336 bytes
!
interface TwoGigabitEthernet1/0/3
 switchport access vlan 77
 switchport mode access
 device-tracking attach-policy DT_POLICY
 access-session host-mode multi-host
 access-session closed
 access-session port-control auto
 mab
 dot1x pae authenticator
 spanning-tree portfast
 service-policy type control subscriber POLICY_Tw1/0/3
end

Switch#
Switch#sh auth sess inter Tw1/0/3 details 
            Interface:  TwoGigabitEthernet1/0/3
               IIF-ID:  0x1FA6B281
          MAC Address:  c85b.768f.51b4
         IPv6 Address:  Unknown
         IPv4 Address:  10.4.18.167
            User-Name:  C8-5B-76-8F-51-B4
               Status:  Authorized
               Domain:  DATA
       Oper host mode:  multi-host
     Oper control dir:  both
      Session timeout:  N/A
    Common Session ID:  33781F0A00000AE958E57C9D
      Acct Session ID:  0x0000000e
               Handle:  0x43000019
       Current Policy:  POLICY_Tw1/0/3


Local Policies:
        Service Template: DEFAULT_LINKSEC_POLICY_SHOULD_SECURE (priority 150)
      Security Policy:  Should Secure

Server Policies:


Method status list:
       Method           State
          mab           Authc Success

Switch#
ISE side
Revision History
Revision Publish Date Comments
1.0
25-Nov-2021
Initial Release
Contributed by Cisco Engineers
Jonathan Casillas Gutierrez
Technical Consulting Engineer
Was this Document Helpful?
Yes No Feedback
Customers Also Viewed
Configure Dynamic VLAN Assignment with ISE and Catalyst 9800 Wireless LAN Controller
ISE Authorization profile
Configure EAP-TLS Authentication with ISE
+ Show 2 More
Contact Cisco
Open a Support Case
(Requires a Cisco Service Contract)
This Document Applies to These Products
Identity Services Engine