End-User Guides
Cisco SD-WAN Systems and Interfaces Configuration Guide, Cisco IOS XE Release 17.x
Bias-Free Language
Book Contents
Translations
Download
Print
Updated:
March 23, 2021
Chapter: Configure VDSL and G.SHDSL
Chapter Contents
This chapter provides usage information and guidelines for configuring very-high-data-rate DSL (VDSL) and G.symmetric high bit rate DSL (G.SHDSL) in SD-WAN mode.
Configure VDSL
Configure G.SHDSL
Configure VDSL
The following table provides usage information and guidelines for configuring asymmetric DSL (ADSL2/2+) and VDSL for supported Integrated Services Router Network Interface Modules (ISR NIMs) in SD-WAN mode. VDSL2 and ADSL2/2+ provide highly reliable WAN connections for remote sites.
For related information, see VDSL Commands.
Function
Command
Guidelines
Configure operating mode
Device# configure terminal
Device(config)# controller VDSL slot/subslot/port
Device(config)# operating mode auto
To switch from operating mode auto adsl1 (adsl2+/ or vdsl2) to operating mode auto ads2+ (adsl1 or vdsl2), switch to operating mode auto first.
Before you change the operating mode, ensure that line-mode is changed to line-mode single-wire line 0.
Enable DSL on a line
Device(config)# line-mode single-wire lineline-number
This command is supported only on DSL NIM-VAB-A.
Enable bonding
Device(config)# line-mode bonding
This command is supported only on DSL NIM-VAB-A.
Load firmware on a device
Device# configure terminal
Device(config)# controller VDSL slot/subslot/port
Device(config-controller)# firmware phy filename filename
The Cisco SD-WAN CLI template does not support specifying the file location. Prepend the file name with flash: or with bootflash:, depending on its location.
Enable or disable SRA
Device(config-controller)# sra
The Cisco SD-WAN CLI template does not support the sra line number command. In line-mode bonding, sra enables sra on both lines and no sra disables sra on both lines.
Enable or disable bitswap
Device(config-controller)# bitswap
The Cisco SD-WAN CLI template does not support the bitswap line number command. In line-mode bonding, bitswap enables bitswap on both lines and no bitswap disables bitswap on both lines.
Enable modem features
Device(config-controller)# modemkeyword
–
Display a description of a controller
Device(config-controller)# description string
–
Enable dual ended line testing
Device(config-controller)# diagnostics DELT
–
Modify the file in which the training log is stored
Device(config-controller)# training log filename flash: filename
The Cisco SD-WAN CLI template does not support specifying the file location. Prepend the file name with flash: or with bootflash: , depending where the file should be stored.
Enable sync mode
Device(config-controller)# sync mode mode
To switch from one sync mode to another, delete the existing sync mode, then configure the new one.
Enable sync interval
Device(config-controller)# sync interval seconds
–
Command Examples
Device# config-transaction
Device(config)# controller VDSL 0/0/0 
Device(config)# operating mode auto
Device# config-transaction
Device(config)# line-mode single-wire line 1
Device# config-transaction
Device(config)# line-mode bonding
Device# config-transaction
Device(config)# controller VDSL 0/0/0
Device(config-controller)# firmware phy filename flash:IDC_1.7.2.6_DFE_FW_BETA_120111A.pkg
Device# config-transaction
Device(config-controller)# sra
Device# config-transaction
Device(config-controller)# bitswap
Device# config-transaction
Device(config)# controller VDSL 0/0/0
Device(config-controller)# modem customUKAnnexM
Device# config-transaction
Device(config)# controller VDSL 0/0/0
Device(config-controller)# description to ISP 1
Device# config-transaction
Device(config)# controller VDSL 0/0/0 
Device(config-controller)# diagnostics DELT
Device# config-transaction
Device(config)# controller VDSL 0/0/0
Device(config-controller)# training log filename bootflash:VDSLLOG.log
Device# config-transaction
Device(config)# controller VDSL 0/0/0
Device(config-controller)# sync mode ansi previous
Device# configure terminal
Device(config)# ptp clock ordinary domain 0
Device(config-ptp-clk)# clock-port slave slaveport
Device(config-ptp-port)# sync interval -4
Device(config-ptp-port)# end
Configuration Example
Device(config)# show controllers vdSL 0/2/0
Controller VDSL 0/2/0 is UP

Daemon Status:          UP 

                        XTU-R (DS)              XTU-C (US)
Chip Vendor ID:         'BDCM'                   'BDCM'
Chip Vendor Specific:   0x0000                   0xA39A
Chip Vendor Country:    0xB500                   0xB500
Modem Vendor ID:        'CSCO'                   'BDCM'
Modem Vendor Specific:  0x4602                   0x0000
Modem Vendor Country:   0xB500                   0xB500
Serial Number Near:     FGL2149956Y C1117-4P 16.7.20180
Serial Number Far:      
Modem Version Near:     16.7.20180709:09395
Modem Version Far:      0xa39a

Modem Status:           TC Sync (Showtime!) 
DSL Config Mode:        AUTO 
Trained Mode:           G.993.2 (VDSL2) Profile 17a

TC Mode:                PTM 
Selftest Result:        0x00 
DELT configuration:     disabled 
DELT state:             not running 

Failed full inits:      0
Short inits:            0
Failed short inits:     0

Modem FW  Version:      4.14L.04
Modem PHY Version:      A2pv6F039t.d26d

Line 0:

                        XTU-R (DS)              XTU-C (US)
Trellis:                 ON                      ON
SRA:                     enabled                 enabled
SRA count:               0                       0
Bit swap:                enabled                 enabled
Bit swap count:          1                       3
Line Attenuation:        18.4 dB                  0.0 dB
Signal Attenuation:       0.0 dB                  0.0 dB
Noise Margin:             5.2 dB                 6.0 dB
Attainable Rate:        46022 kbits/s            18866 kbits/s
Actual Power:           14.5 dBm                10.4 dBm
Per Band Status:        D1      D2      D3      U0      U1      U2      U3
Line Attenuation(dB):   13.9    32.7    50.1    N/A     25.6    37.7    42.3
Signal Attenuation(dB): 13.5    32.4    N/A     N/A     25.0    36.9    41.9
Noise Margin(dB):       5.3     5.1     N/A     N/A     6.0     6.0     5.9
Total FECC:             446                      0
Total ES:               3                        0
Total SES:              0                        0
Total LOSS:             0                        0
Total UAS:              50                       50
Total LPRS:             0                        0
Total LOFS:             0                        0
Total LOLS:             0                        0


                  DS Channel1     DS Channel0   US Channel1       US Channel0
Speed (kbps):             NA           47610            NA             18859
SRA Previous Speed:       NA               0            NA                 0
Previous Speed:           NA               0            NA                 0
Reed-Solomon EC:          NA             446            NA                 0
CRC Errors:               NA              51            NA                 0
Header Errors:            NA            3935            NA                 0
Interleave (ms):          NA            1.00            NA              1.00
Actual INP:               NA            0.00            NA              0.00

Training Log :  Stopped
Training Log Filename : flash:vdsllog.bin
Configure G.SHDSL
Overview
G.SHDSL is an international standard that allows devices to send and receive high-speed symmetrical data streams over a single pair of copper wires. This section provides information about the Cisco G.SHDSL EFM/ATM NIM and provides guidelines for configuring G.SHDSL in SD-WAN mode.
For related information, see Configuring Cisco G.SHDSL HWICs in Cisco Access Routers and VDSL Commands.
Cisco G.SHDSL EFM/ATM NIM
The Cisco G.SHDSL EFM/ATM NIM connects Cisco 4000 Series Integrated Services Routers with central office Digital Subscriber Line Access Multiplexers (DSLAMs) and supports up to four DSL pairs. The DSL pairs are bundled in groups and configured in the Cisco IOS CLI by using the dsl-group command. Use the mode command to choose the mode (ATM or EFM).
The NIM supports the following configuration:
You can configure up to four DSL groups.
You can configure auto mode on only one DSL group. For example, DSL group 0.
In ATM Mode, you can configure the lines to use 2-wire, 4-wire (standard or enhanced), or m-pair.
In EFM mode, you can configure a DSL group with any one of the lines in 2-wire non-bonding mode or with multiple lines in bonding mode.
Depending on the mode (ATM or EFM), the corresponding interface (ATM or EFM) is automatically created.
Cisco G.SHDSL Configuration Guidelines
The following table provides usage information and guidelines that apply when you configure the Cisco G.SHDSL EFM/ATM in CPE or CO mode.
Function
Command
Guidelines
Configure a device with the dsl-group auto command
Device(config-controller)# dsl-group auto
Use customer premises equipment (CPE) mode when configuring a device with the dsl-group auto command. If you use this command in Central Office (CO) mode, the configuration does not take effect.
Add or delete a link
—
The efm-grp command is not supported. To add or delete a link to a dsl-group, delete the dsl-group, then create a new dsl-group.
Load firmware on a device
Device(config-controller)# firmware phy filename location
File name location options are not supported when using the firmware phy command. Prepend the file name with flash: or with bootflash: , depending on the location.
Create or delete an annex
Device(config-controller-dsl-group)# no shdsl annex
Device(config-controller-dsl-group)# no shdsl rate rate
To avoid Cisco IOS and Cisco SD-WAN configuration from going out of sync when you create or delete an annex, create or delete the rate in the same transaction.
Enable SHDSL to use enhanced mode
(config-controller-dsl-group)# shdsl 4-wire mode enhanced
To enable SHDSL to use the enhanced mode in a 2-pair digital subscriber line (DSL) group, use the shdsl 4-wire mode enhanced command in configuration controller DSL group mode.
Ignore CRC errors
(config-controller-dsl-group)# ignoreseconds
To configure a device to ignore CRC errors, use the ignore command. Replace timeout with a value from 0 through 60, which indicates the number of seconds that the device ignores CRC errors that do not resolve before the device terminates an action.
Shutdown a DSL group
(config-controller-dsl-group)# shutdown
To shut down a DSL group, use the shutdown command.
Examples
Device# config-transaction
Device(config)# controller SHDSL 0/0/0 
Device(config-controller)# dsl-group auto
Device# config-transaction
Device(config)# controller VDSL 0/0/0
Device(config-controller)# firmware phy filename bootflash:IDC_1.1.1.0_DFE_1.1-1.8.1__001.pkg
Device# config-transaction
Device(config)# controller SHDSL 0/0/0
Device(config-controller)# dsl-group 0 pairs 0 
Device(config-controller-dsl-group)# no shdsl annex
Device(config-controller-dsl-group)# no shdsl rate 5696
Device# config-transaction
Device(config)# controller SHDSL 0/0/0
Device(config-controller)# termination cpe
Device(config-controller)# dsl-group 0 pairs 0 
(config-controller-dsl-group)# shdsl 4-wire mode enhanced
Device# config-transaction
Device(config)# controller SHDSL 0/0/0
Device(config-controller)# termination cpe
Device(config-controller)# dsl-group 0 pairs 0 
config-controller-dsl-group)# ignore 30
Device# config-transaction
Device(config)# controller SHDSL 0/0/0
Device(config-controller)# termination cpe
Device(config-controller)# dsl-group 0 pairs 0 
config-controller-dsl-group)# shutdown
Configuration Example
Device# sh controllers shDSL 0/1/0
Controller SHDSL 0/1/0 is UP
  Hardware is NIM-SHDSL-EA, on slot 0,bay 0 
  Capabilities: EFM: 2-wire, EFM-Bond, Annex A, B, F & G
                ATM: 2-wire, Mpair, Annex A, B, F & G
  CPE termination
  cdb=0x7F7EB723D8A8
  Vendor: Intel, Chipset: SOCRATES-4e
  PHY Source: System
  IDC Firmware version: 0.0.0.0
  DFE Firmware version: 
  Group 0 info:
        Type: EFM Auto status: Down
         Ethernet Interface: Ethernet0/1/0, hwidb: 0x7F7EB723B648
         ATM Interface: ATM0/1/0, hwidb: 0x7F7EB724CE08
        Configured/active num links: 4/0, bit map: 0xF/0x0
        Line termination: CPE, Annex: auto
        PMMS disabled,Line coding: AUTO-TCPAM
        Configured/actual rate: AUTO/0 kbps
        Dying Gasp: Present
        SHDSL wire-pair (0) is in DSL DOWN state
                LOSWS Defect alarm: none
                SNR Margin alarm: none
                Loop Attenuation alarm: none
                Termination: CPE, Line mode: EFM Auto, Annex: auto
                Line coding: AUTO-TCPAM
                Configured/actual rate: AUTO/0 kbps
                Modem status: DOWN_NOT_READY,Condition: NO_COND_
        DSL Stats:
                Power Back Off: 0dB
                LoopAttn: 0dB, SnrMargin: 0dB
                Current 15 minute statistics (Time elapased 1 seconds)
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Previous 15 minute statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Current 24 hr statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Previous 24 hr statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
        EFM Stats:
                EFM-TC Tx: data frames: 0
                EFM-TC Rx: data frames: 0
        SHDSL wire-pair (1) is in DSL DOWN state
                LOSWS Defect alarm: none
                SNR Margin alarm: none
                Loop Attenuation alarm: none
                Termination: CPE, Line mode: EFM Auto, Annex: auto
                Line coding: AUTO-TCPAM
                Configured/actual rate: AUTO/0 kbps
                Modem status: DOWN_NOT_READY,Condition: NO_COND_
        DSL Stats:
                Power Back Off: 0dB
                LoopAttn: 0dB, SnrMargin: 0dB
                Current 15 minute statistics (Time elapased 1 seconds)
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Previous 15 minute statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Current 24 hr statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Previous 24 hr statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
        EFM Stats:
                EFM-TC Tx: data frames: 0
                EFM-TC Rx: data frames: 0
        SHDSL wire-pair (2) is in DSL DOWN state
                LOSWS Defect alarm: none
                SNR Margin alarm: none
                Loop Attenuation alarm: none
                Termination: CPE, Line mode: EFM Auto, Annex: auto
                Line coding: AUTO-TCPAM
                Configured/actual rate: AUTO/0 kbps
                Modem status: DOWN_NOT_READY,Condition: NO_COND_
        DSL Stats:
                Power Back Off: 0dB
                LoopAttn: 0dB, SnrMargin: 0dB
                Current 15 minute statistics (Time elapased 1 seconds)
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Previous 15 minute statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Current 24 hr statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Previous 24 hr statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
        EFM Stats:
                EFM-TC Tx: data frames: 0
                EFM-TC Rx: data frames: 0
        SHDSL wire-pair (3) is in DSL DOWN state
                LOSWS Defect alarm: none
                SNR Margin alarm: none
                Loop Attenuation alarm: none
                Termination: CPE, Line mode: EFM Auto, Annex: auto
                Line coding: AUTO-TCPAM
                Configured/actual rate: AUTO/0 kbps
                Modem status: DOWN_NOT_READY,Condition: NO_COND_
        DSL Stats:
                Power Back Off: 0dB
                LoopAttn: 0dB, SnrMargin: 0dB
                Current 15 minute statistics (Time elapased 1 seconds)
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Previous 15 minute statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Current 24 hr statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
                Previous 24 hr statistics
                        ES:0, SES:0, CRC:0, LOSWS:0, UAS:0
        EFM Stats:
                EFM-TC Tx: data frames: 0
                EFM-TC Rx: data frames: 0
  Group 1 is not configured
  Group 2 is not configured
  Group 3 is not configured
Was this Document Helpful?
Yes No
Feedback
Customers Also Viewed
Identify vEdge Certificate Expired on May 9, 2023
Cisco SD-WAN Getting Started Guide --- Install and Upgrade Cisco IOS XE Release 17.2.1r and Later
Cisco SD-WAN Getting Started Guide --- Cisco SD-WAN Overlay Network Bring-Up Process
+ Show 3 More
Contact Cisco
Open a Support Case
(Requires a Cisco Service Contract)