Configuration Guides
Cisco 3900 Series, 2900 Series, and 1900 Series Software Configuration Guide
Bias-Free Language
Book Contents
Download
Print
Updated:
March 30, 2016
Chapter: Configuring EtherChannel
Chapter Contents
This chapter describes how to configure EtherChannels on Layer 3 ports on Cisco 1900, 2900, and 3900 Series ISRs. EtherChannel provides fault-tolerant high-speed links between switches, routers, and servers.
Understanding EtherChannel Feature
EtherChannel allows multiple physical Ethernet links to be combined into one logical link. If a segment within an EtherChannel fails, traffic previously carried over the failed link switches to the remaining segments with in the EtherChannel. Thus, EtherChannel provides automatic recovery for the loss of a link by redistributing the load across the remaining links.
The purpose of the EtherChannel feature is to provide redundancy between ISR and another device and not to provide scalable bandwidth between them.
Restrictions and Guidelines for EtherChannel Feature
These restrictions and guidelines apply while configuring EtherChannel feature.
Configure all physical ports in an EtherChannel manually; Negotiation protocol PAgP and LACP are not supported.
Each EtherChannel can consists of up to four compatibly configured physical ports. Configuring more than two EtherChannel per platform is not supported.
Configure all physical ports in an EtherChannel to work at the same criteria such as speed, duplex, and trunk mode.
Each physical port can be a member of one EtherChannel group.
Assign layer 3 addresses to the port channel logical interface, not to the physical ports in the channel.
If trunking is required, make sure IEEE 802.1Q is used. Trunking protocol ISL is not supported.
After you configure an EtherChannel, the configuration that you apply to the physical ports affects only the LAN port where you apply the configuration.
Configuring EtherChannel.
Perform these steps to configure the EtherChannel feature on Cisco 1900, 2900 and 3900 series ISRs.
SUMMARY STEPS
1. configure terminal
2. interface port-channel number
3. ip address ip-address mask
4. end
5. interface range type number - number
6. channel-group number
7. end
DETAILED STEPS
  Command
Purpose
Step 1
configure terminal
Example:
Router# configure terminal
  Enters global configuration mode.
Step 2
interface port-channel number
Example:
Router(config)# interface port-channel 1
Specify the EtherChannel (port channel) logical interface, and enter interface configuration mode.
Step 3
ip address ip-address mask
Example:
Router(config-if)# ip address 10.0.0.1 255.255.255.0
Assign an IP address and subnet mask to the EtherChannel.
Step 4
end
Example:
Router(config-if)# end
Returns to privileged EXEC mode.
Step 5
interface range type number - number
Example:
Router(config)# interface range gigabitEthernet 0/0-1
Configures the interface range for the EtherChannel.
Step 6
channel-group number
Example:
Router(config-if)# channel-group 1
Add the physical interfaces to the port channel.
Step 7
end
Example:
Router(config-if)# end
Returns to privileged EXEC mode.
Example: Configuring an EtherChannel
This example shows configuring EtherChannel 1 and adding physical interfaces to the EtherChannel.
Router# configure terminal
Router(config)# interface port-channel 1
Router(config-if)# ip address 10.0.0.1 255.255.255.0
Router(config-if)# end
Router(config)# interface range gigabitEthernet 0/0-1
Router(config-if)# channel-group 1
Router(config-if)# end
Was this Document Helpful?
Yes No
Feedback
Contact Cisco
Open a Support Case
(Requires a Cisco Service Contract)