Command References
Cisco SD-WAN Command Reference
Bias-Free Language
Book Contents
Download
Print
Updated:
July 15, 2019
Chapter: Configuration Management Commands
Chapter Contents

Note
For a list of Cisco IOS XE SD-WAN commands qualified for use in Cisco vManage CLI templates, see List of Commands Qualified in Cisco IOS XE Release 17.x. For information about specific commands, see the appropriate chapter in Cisco IOS XE SD-WAN Qualified Command Reference Guide.
Overview of Configuration Management Commands
abort
clear
commit
describe
do
end
exit
help
load
no
pwd
revert
rollback
save
show configuration
show configuration commit
show configuration diff
show configuration merge
show configuration rollback
show configuration running
show full-configuration
show history
show parser dump
top
validate
Overview of Configuration Management Commands
The configuration management command reference pages describe the CLI commands that you use to manage a configuration on vSmart controllers, vEdge routers, and vBond orchestrators. You know that you are in configuration mode because the CLI prompt changes to include the string (config).
In the CLI, the configuration management commands are grouped together after the functional configuration commands, and they are organized alphabetically. Some of commands are organized into functional hierarchies. The top-level configuration management commands and command hierarchies are:
abort—End the configuration session.
clear—Remove all changes to the configuration.
commit—Activate the configuration.
describe—Display help about the configuration commands.
do—Run an operational command without exiting from configuration mode.
end—End the configuration session.
exit—Exit from the current configuration level.
help—Display help information about CLI commands.
load—Load the configuration from an ASCII text file.
no—Negate a command.
pwd—Display the current configuration level.
revert—Return to the running configuration.
rollback—Return to a previously committed version of the configuration.
save—Save the configuration to an ASCII text file.
show—Display a configuration parameter.
top—Return to the top level in the configuration.
validate—Validate the configuration.
The configuration commands themselves are described under Configuration Commands.
abort
Exit configure mode immediately, without displaying a prompt warning you to save uncommitted changes.
abort
Syntax Description
None
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
vedge1(config)# abort
vedge1#
Related References
clear
commit
rollback
clear
Clear all changes made to the configuration during the current session.
clear
Syntax Description
None
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
vvedge1(config)# clear
All configuration changes will be lost. Proceed? [yes, NO] yes
vedge1(config)#
Related References
abort
rollback
commit
Activate the commands in the configuration on the Cisco vEdge device and make it the running configuration. You issue this commit command from configuration mode.
commit (abort | and-quit | check | confirmed [timeout] [persist] | no-confirm) [comment text] [label text] [persist-id id] [save-running filename]
Syntax Description
None: Activate the commands in the configuration and remain at the same hierarchy in configuration mode.
comment text
Add a text comment about the commit operation. If the text string contains spaces, enclose the entire string in quotation marks (" "). Any comments are display in the output of the show configuration commit list command.
label text
Add a text label that describes the commit operation. If the text string contains spaces, enclose the entire string in quotation marks (" "). Any labels are display in the output of the show configuration commit list command.
and-quit
Exit from Configuration Mode: Active the configuration and return to operational mode.
abort
Halt a Commit Operation: Halt a provisional commit operation.
confirmed [timeout] [persist]
Provisional Commit Operation: Commit the current configuration to the running configuration. If no commit confirm command is issued before the timeout period, specified in minutes, expires, the configuration reverts to what was active before the commit confirmed command was issued. The default timeout is 10 minutes. The configuration session terminates after you issue this command, because no further editing is possible. This command is available only in configure exclusive and configure shared mode when the system has been configured with a candidate configuration. If the CLI session is terminated before the  commit confirm command is issued, the configuration reverts to the previously active configuration. If you include the persist option, you can terminate the CLI session before you issue the commit confirm command, and you can then confirm the pending commit in a later session by supplying the persist token as an argument to the commit command using the persist-id option.
A commit confirmed command is valid only for the candidate datastore where the configuration parameter /confdConfig/datastores/running/access is set to writable-through-candidate in the confd.conf file and the configuration mode is set to either configure exclusive or configure shared mode. A candidate datastore provides a temporary work space in which a copy of the running configuration for the Cisco vEdge device is stored. You can create and modify the running configuration before committing the running configuration to the device.
On Cisco vEdge devices, we have enabled writable-through-candidate in the confd file, which means that commit confirmed works only for configure exclusive or configure shared modes. By default, the configuration enters configure private mode, and therefore, your changes are written directly to the running configuration rather than to the candidate datastore. If you intend to use commit confirmed, use configure exclusive or configure shared modes.
persist-id id
Persist Token: If a prior confirming commit operation has been performed with the persist argument, include the persist-id option, specifying the same persist token, to modify the ongoing confirming commit process. This allows you, for example, to cancel an ongoing persist commit operation or extend the timeout.
save-running filename
Save the Configuration to a File: Save a text copy of the running configuration to the specified file.
check
Validate the Configuration: Validate current configuration and indicate any configuration errors.
Command History
Release Modification
14.1
Command introduced.
15.2
"system is-vmanaged" warning added
Example
Example 1
vedge1(config-system)# commit and-quit
Commit complete.
vedge1#
Example 2
vm5# config exclusive 
Entering configuration mode exclusive
Warning: uncommitted changes will be discarded on exit
vm5(config)# vpn 3
vm5(config-vpn-3)# commit confirmed 
Warning: The configuration will be reverted if you exit the CLI without
performing the commit operation within 10 minutes.
vm5(config-vpn-3)# commit
Commit complete. Configuration is now permanent.
vm5(config-vpn-3)# exit
Related References
commit
show configuration commit list
validate
describe
Display internal information about how a configuration command is implemented.
describe command
Syntax Description
command
Information about a Command: Display internal information about a command's implementation.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
vm4(config)# describe vpn 
Common
    Source          : YANG
    Module          : viptela-vpn
    Namespace       : http://viptela.com/vpn
    Path            : /vpn
    Node            : container
    Revision        : 2013-02-12
    Exported agents : all
    Checksum        : 5b30372a4dedcad2a01633f79395720
Related References
show parser dump
do
Run an operational command from within configuration mode.
do command
Syntax Description
command
Command Name: Run the specified operational-mode command.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
vedge1(config-vpn-0)# do show version
14.0b 20131206-2 build 52
vedge1(config)#
Related References
Overview of Operational Commands
end
Exit configuration mode.
end [no-confirm]
Syntax Description
None: If no changes have been made to the configuration, exit configuration mode immediately. If changes have been made, you are asked to save the changes before existing configuration mode.
no-confirm
Exit Immediately: Exit configuration mode immediately, without committing an changes to the configuration.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
vedge1(config-banner)# end
Uncommitted changes found, commit them? [yes/no/CANCEL] no
vedge1#
Related References
abort
exit
exit
Exit from the current mode in the configuration, or exit configuration mode altogether.
exit [configuration-mode] [level] [no-confirm]
Syntax Description
None: Exit from the current level in the configuration, and move up one hierarchy level.
configuration-mode
Exit Configuration Mode: If changes have been made to the configuration, you are prompted to commit them.
no-confirm
Exit Configuration Mode Immediately: Exit configuration mode immediately, without being prompted to commit any changes to the configuration.
level
Exit the Current Level: Exit from the current level in the configuration, and move up one hierarchy level. This is the default behavior if you type the exit command with no options.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
vedge1(config)# vpn 0 interface ge0/0
vedge1(config-interface-ge0/0)# exit
vedge1(config-vpn-0)#vedge1(config-banner)# exit configuration-mode
Uncommitted changes found, commit them? [yes/no/CANCEL] no
vedge1#
Related References
end
help
Display help information about a command.
help command
Syntax Description
command
Help about a Command: Display short help information about a command.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
vedge1(config)# help banner
Help for command: banner
    Set banners
Related References
show parser dump
show parser dump
load
Load the configuration from a file.
load (merge | override | replace) file-path
Syntax Description
file-path
File Path: Path to the directory and filename of the file containing the configuration. It can be one of the following:
ftp:// user:password@host:port/file-path—Path to a file on an FTP server.
scp:// user @ host : file-path
/ file-path / filename—Path to a file on the local Cisco vEdge device.
merge file-path
Merge with the Existing Configuration: Merge the configuration in the specified file with the current configuration.
override file-path
Override the Existing Configuration: Delete the current configuration and then replace it with a new configuration, which is loaded from the specified file.
replace file-path
Replace the Existing Configuration: Replace the corresponding parts of the current configuration with the contents of the specified file. This option differs from the override option in that only the parts of the configuration contained in the specified file are replaced. The rest of the configuration is unchanged.

Note
load override and load merge is not supported on Cisco IOS XE devices.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Load the configuration from a file on the router:
vm4(config)# load replace test-configuration-file 
Loading.
1.18 KiB parsed in 0.09 sec (12.05 KiB/sec)
vm4(config)#
Related References
file list
rollback
save
no
Delete or unset a configuration command or parameter.
no command
Syntax Description
command
Delete or Unset a Command: Delete or unset the specified command from the configuration.
Command History
Release Modification
14.1
Command introduced.
Examples
Example 1
Delete the login banner from the configuration:
vm4(config)# banner login "Welcome to vEdge4"
vm4(config-banner)# commit and-quit 
Commit complete.
vm4# show running-config banner 
banner
 login "Welcome to vEdge4"
!
vm4# config
Entering configuration mode terminal
vm4(config)# no banner login
vm4(config)# commit and-quit 
Commit complete.
vm4# show running-config banner
% No entries found.
Example 2
Enable the operation of an interface:
vm4# show running-config vpn 0 interface ge0/7vpn 0
 interface ge0/7
  ip address 10.0.100.14/24
  no shutdown
 !
!
Related References
Overview of Configuration Commands
pwd
Display the current path in the configuration hierarchy.
pwd
Syntax Description
None
Command History
Release Modification
14.1
Commad introduced.
Example
Example 1
vedge1(config)# pwd
At top level
vedge1(config)# vpn 0 interface ge0/0
vedge1(config-interface-ge0/0)# pwd
Current submode path:
  vpn vpn-instance 0 \ interface ge0/0
vedge1(config-interface-ge0/0)#
Related References
exit
top
revert
Copy the running configuration into the current candidate configuration.
revert [no-confirm]
Syntax Description
None: Copy the running configuration into the current candidate configuration, thus losing all configuration changes that have been made during this session. You are prompted to confirm this action.
no-confirm
Return to the Running Configuration Immediately: Immediately copy the running configuration into the current candidate configuration, thus losing all configuration changes that have been made during this session. You are not prompted to confirm this action.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
vedge1(config)# revert
% No configuration changes.
vedge1(config)# no banner
vedge1(config)# revert
All configuration changes will be lost. Proceed? [yes, NO] no
Aborted: by user
vedge1(config)#
Related References
load
rollback
rollback
Return to a previously committed configuration.
rollback (configuration [number] | selective number)
Syntax Description
rollback configuration
Return to the Previously Committed Configuration: Return to the most recently committed configuration. You are not prompted to confirm this action, and you lose all configuration changes that have been made during this session.
rollback configuration [number] 
Return to an Earlier Committed Configuration: Return to the configuration changes made in all commit operations up to a particular rollback number. If you omit the number, you return to the previously committed configuration, which is rollback 0. Use the rollback configuration ?  to display the configuration numbers and the dates and times that the configurations were committed. For example, the command rollback configuration 1  returns to the configuration changes made in rollback versions 0 and 1.
rollbackselective
Return to a Particular Earlier Committed Configuration: Return to the configuration changes made in a specific commit operation. Use the rollback configuration ?  to display the configuration numbers and the dates and times that the configurations were committed. For example, the command rollback configuration 1 returns to the configuration changes made in rollback version 1.
Command History
Release Modification
14.1
Command introduced.
Examples
Example 1
Roll back to the last two sets of configuration changes:
vsmart(config)# do show running-config policy
% No entries found.
vsmart(config)# policy lists site-list s site-id 10
vsmart(config-site-list-s)# commit
Commit complete.
config# do show running-config policy
policy
lists
  site-list s
   site-id 10
  !
!
!vsmart(config-lists)# vpn-list v vpn 1
vsmart(config-vpn-list-v)# commit
Commit complete.
vsmart(config-vpn-list-v)#
vsmart(config)# do show running-config policy
policy
lists
  vpn-list v
   vpn 1
  !
  site-list s
   site-id 10
  !
 !
!
vsmart(config)# rollback configuration
Possible completions:
  0      2013-12-12 12:01:05 by admin via cli
  1      2013-12-12 12:00:50 by admin via cli
  <cr>   latest
vsmart(config)# rollback configuration 1       ========> rollback 0 and 1 are applied
vsmart(config)# show configuration
policy
lists
  no vpn-list v
  no site-list s
 !
!
Example 2
Roll back to only the second previous configuration:
vsmart(config)# clear
All configuration changes will be lost. Proceed? [yes, NO] yes
vsmart(config)# show configuration
% No configuration changes found.
vsmart(config)# rollback selective
Possible completions:
0 2013-12-12 12:01:05 by admin via cli
1 2013-12-12 12:00:50 by admin via cli
<cr> latest
vsmart(config)# rollback selective 1 ==========> Only rollback 1 applied
vsmart(config)# top show configuration
policy
lists
   no site-list s
!
!
Related References
load
revert
save
Save the entire current configuration or parts of it to a file.
save file-path[hierarchy] [overwrite]
Syntax Description
file-path
File Path: Path to the directory and filename of the file containing the configuration. It can be one of the following:
ftp: file-path—Path to a file on an FTP server.
scp: user @ host : file-path.
/ file-path / filename—Path to a file on the local Cisco vEdge device.
overwrite
Overwrite an Existing File: Overwrite the contents of an existing file.
save filename
Save the Entire Configuration: Save the entire configuration to a file.
save filename hierarchy
Save a Portion of the Configuration: Save the specified configuration hierarchy to a file.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Save the configuration to a file:
vedge1(config)# save config-system system
Saving system
vedge1(config)# do file show config-system
system
 host-name vedge1
 system-ip 172.16.255.1 
 domain-id 1
 site-id   1
 clock timezone America/Los_Angeles
 vbond 10.0.14.4
 aaa
  auth-order local radius
  usergroup basic
   task system read write
   task interface read write
  !
  usergroup netadmin
  !
  usergroup operator
   task system read
   task interface read
   task policy read
   task routing read
   task security read
  !
  user admin
   password $1$zvOh58pk$QLX7/RS/F0c6ar94.xl2k.
  !
  user eve
   password $1$aLEJ6jve$aBpPQpkl3h.SvA2dt4/6E/
   group    operator
  !
 !
 logging
  disk
   enable
  !
 !
!
Related References
file list
file show
load
show configuration
Display changes that have been made to the configuration during the current editing session. The changes are displayed is the same format as the configuration is displayed when you issue a show full-configuration configuration command or a show running-config operational command.
show configuration [hierarchy]
Syntax Description
None: Show all configuration changes.
hierarchy
Specific Hierarchy: Show all the changes in a specific configuration hierarchy.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Display all configuration changes:
vm4(config)# banner motd "Welcome to vEdge4"
vm4(config-banner)# top 
vm4(config)# show configuration 
banner
motd "Welcome to vEdge4"
!
Related References
show configuration commit
show configuration diff
show configuration merge
show configuration running
show full-configuration
show configuration commit
Display the configuration changes that took effect as the result of a previous commit operation.
show configuration commit changes (rollback-number | latest)
show configuration commit changes diff (rollback-number | latest)
show configuration commit list [number]
Syntax Description
(rollback-number | latest)
Configuration Changes Since a Specific Commit: List the configuration changes since a specific commit operation. rollback-number  is the commit identifier. latest  is the last commit operation. The changes are displayed is the same format as the configuration is displayed when you issue a show full-configuration  configuration command or a show running-config  operational command.
diff (rollback-number | latest)
Configuration Changes Since a Specific Commit, in Diff Format: List the configuration changes since a specific commit operation. rollback-number  is the commit identifier. latest  is the last commit operation. The changes are displayed is a UNIX diff-style format.
list [number]
Show the Configuration Commit History: List the commit identifiers and information about the previous commit operations.
Command History
Release Modification
14.1
Command introduced.
Examples
Example 1
Display configuration changes:
vm4(config)# show configuration commit changes diff 1 
+banner
+ login "Welcome to vEdge4"
+!
vm4(config)# show configuration commit changes 1
banner
 login "Welcome to vEdge4"
!
Example 2
List an abridged commit history:
vm4(config)# show configuration commit list 10
2014-03-12 01:00:32
SNo. ID       User       Client      Time Stamp          Label       Comment
0    10042    admin      cli         2014-03-12 00:14:04             
1    10041    admin      cli         2014-03-12 00:13:48             
2    10040    admin      cli         2014-03-11 18:19:38             
3    10039    admin      cli         2014-03-11 18:19:13             
4    10038    admin      cli         2014-03-11 14:00:31             
5    10037    admin      cli         2014-03-11 13:59:49             
6    10036    admin      cli         2014-03-11 13:59:38             
7    10035    admin      cli         2014-03-11 13:59:37             
8    10034    admin      cli         2014-03-11 13:59:37             
9    10033    admin      cli         2014-03-11 13:59:36
Related References
show configuration
show configuration diff
show configuration merge
show configuration running
show full-configuration
show configuration diff
Display changes that have been made to the configuration during the current editing session. The changes are displayed is UNIX-style diff format.
show configuration diff [hierarchy]
Syntax Description
None: Show all configuration changes.
hierarchy
Specific Hierarchy: Show all the changes in a specific configuration hierarchy.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Display all configuration changes:
vm4(config)# show configuration diff 
 banner
+ login "Welcome to vEdge4"
 !
Related References
show configuration
show configuration commit
show configuration rollback
show configuration running
show full-configuration
show configuration merge
Display a combination of the running and target configurations.
show configuration merge [hierarchy]
Syntax Description
None: Show a combination of the running and target configurations for the entire configuration.
hierarchy
Specific Hierarchy: Show a combination of the running and target configurations for the specific configuration hierarchy.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Display the merged configuration for a specific command hierarchy:
vm4(config)# show configuration merge banner       
banner
 login "Welcome to vEdge4"
 motd  "Welcome to vEdge4"
!
Related References
show configuration
show configuration commit
show configuration diff
show configuration rollback
show configuration running
show full-configuration
show configuration rollback
Compare the current target configuration to the configuration in a previously committed version, and display the differences.
show configuration rollback changes (rollback-number | latest)
Syntax Description
(rollback-number | latest)
Specific Previous Commit: List the configuration differences since a specific commit operation. rollback-number is the commit identifier. latest is the last commit operation. 
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Display the configuration differences from previously committed configurations:
vm4(config)# show configuration rollback changes 1
banner
 login "Welcome to vEdge4"
 no motd "Welcome to vEdge4"
!
vm4(config)# show configuration rollback changes 2
no banner
vm4(config)# show configuration rollback changes 3
no banner
vpn 0
 interface ge0/4
  tunnel-interface
   clear-dont-fragment
  !
 !
!
Related References
rollback
show configuration
show configuration commit
show configuration diff
show configuration running
show configuration running
Display the running configuration.
show configuration running [hierarchy]
Syntax Description
None: Show the entire configuration.
hierarchy
Specific Hierarchy: Show the running configuration in a specific configuration hierarchy.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Display the running configuration in a hierarchy:
vm4(config)# show configuration running banner
banner
 motd "Welcome to vEdge4"
!
Related References
show configuration
show configuration commit
show configuration diff
show configuration merge
show configuration rollback
show full-configuration
show full-configuration
Display the current configuration, which is a combination of the running and candidate configurations.
show full-configuration [hierarchy]
Syntax Description
None: Show the entire configuration.
hierarchy
Specific Hierarchy: Show the configuration in a specific configuration hierarchy.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Display the running and candidate configuration in a hierarchy:
vm4(config)# show full-configuration banner
banner
 login "Welcome to vEdge4"
 motd  "Welcome to vEdge4"
!
Related References
show configuration
show configuration commit
show configuration diff
show configuration merge
show configuration running
show history
Display the history of the commands issued in the current configuration session.
show history [number]
Syntax Description
None: Display all commands that have been issued in the current configuration session.
number
Specific Number of Commands: Display the specified number of most recent commands that have been issued in the current configuration session.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Display a limited number of configuration session commands:
vm4(config)# show history 12
02:07:53 -- show configuration merge banner
02:09:45 -- show configuration rollback changes 14
02:10:11 -- show full-configuration 
02:14:20 -- show full-configuration banner
02:15:52 -- show configuration running 
02:18:18 -- show configuration running banner
02:22:06 -- show configuration rollback changes 1
02:22:13 -- show configuration rollback changes 2
02:22:16 -- show configuration rollback changes 3
02:34:36 -- show configuration this omp
02:34:43 -- show configuration this banner 
02:35:32 -- show history 12
vm4(config)#
Related References
show history
show parser dump
Display the syntax of the configuration commands.
show parser dump [hierarchy]
Syntax Description
None: Display the syntax of all configuration commands.
hierarchy
Specific Hierarchy: Display the syntax of the configuration commands in a specified hierarchy.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
Display a limited number of configuration session commands:
vm4(config)# show parser dump banner
banner 
banner login <string,-min:-1-chars,-max:-128-chars> 
banner login <string,-min:-1-chars,-max:-128-chars> motd <string,-min:-1-chars,-max:-128-chars> 
banner motd <string,-min:-1-chars,-max:-128-chars>

vm4(config)# show parser dump vpn router | include area    
vpn router router ospf area <a-num:unsignedInt> 
vpn router router ospf area <a-num:unsignedInt> nssa 
vpn router router ospf area <a-num:unsignedInt> nssa no-summary 
vpn router router ospf area <a-num:unsignedInt> nssa translate [candidate/never/always] 
vpn router router ospf area <a-num:unsignedInt> nssa translate [candidate/never/always] no-summary 
vpn router router ospf area <a-num:unsignedInt> range <IPv4-address/prefix-length> 
vpn router router ospf area <a-num:unsignedInt> range <IPv4-address/prefix-length> cost <0..16777215> 
vpn router router ospf area <a-num:unsignedInt> range <IPv4-address/prefix-length> cost <0..16777215> no-advertise 
vpn router router ospf area <a-num:unsignedInt> range <IPv4-address/prefix-length> no-advertise 
vpn router router ospf area <a-num:unsignedInt> stub 
vpn router router ospf area <a-num:unsignedInt> stub no-summary 
vpn router router ospf distance external <1..255> inter-area <1..255> 
vpn router router ospf distance external <1..255> inter-area <1..255> intra-area <1..255> 
vpn router router ospf distance inter-area <1..255> 
vpn router router ospf distance intra-area <1..255> 
Related References
show parser dump
top
Move to the top level of the configuration hierarchy.
top [configuration-command]
Syntax Description
None: Move to the top level of the configuration hierarchy.
configuration-command
Execute a Configuration Command: Execute a configuration command from the top level of the configuration hierarchy without actually moving to the top level of the configuration hierarchy.
Command History
Release Modification
14.1
Command introduced.
Example
Example 1
vedge1(config-interface-ge0/0)# top
vedge1(config)# system aaa usergroup operator
vedge1(config-usergroup-operator)# top banner motd "Welcome"
vedge1(config-usergroup-operator)# top show configuration
banner
 motd Welcome
!
vedge1(config-usergroup-operator)# 
Related References
exit
validate
Verify that the candidate configuration contains no errors.
validate
Syntax Description
None
Command History
Release Modification
14.1
Command introduced.
15.2
"system is-vmanaged" warning added
Example
Example 1
vm4(config)# validate 
Validation complete
vm4(config)#
Related References
commit
Was this Document Helpful?
Yes No
Feedback
Customers Also Viewed
Cisco SD-WAN Command Reference --- Configuration Commands
Cisco SD-WAN Command Reference --- Operational Commands
Cisco SD-WAN Command Reference --- CLI Configuration Commands
+ Show 3 More
Contact Cisco
Open a Support Case
(Requires a Cisco Service Contract)