Command References
Cisco IOS XE SD-WAN Qualified Command Reference
Bias-Free Language
Book Contents
Download
Print
Updated:
December 17, 2021
Chapter: VRRP Commands
Chapter Contents
object (tracking)
track interface
track list
track (VRRP)
track service
tloc-change increase-preference
vrf forwarding
vrrp address-family
object (tracking)
To specify an object for a tracked list, use the object command in tracking configuration mode. To remove the object from the tracked list, use the no form of this command.
object object-number [not]
no object object-number
Syntax Description
object-number
Specifies the tracked object number in a tracked list. The range is from 1–1000.
not
(Optional) Negates the state of an object.
Note
  The not keyword can be used in a Boolean list.
Command Default
The object isn't included in the tracked list.
Command Modes
Tracking configuration (config-track)
Command History
Release
Modification
Cisco IOS XE Release 17.7.1a
This command was introduced.
Usage Guidelines
For usage guidelines, see the Cisco IOS XE object (tracking) command.
The following example shows two serial interfaces (objects) that are in tracked list 100. The Boolean “not” negates the state of object 2, resulting in the tracked list regarding object 2 as down when it's up:
Device(config)# track 1 interface serial2/0 line-protocol
Device(config-track)# exit
Device(config)# track 2 interface serial2/1 line-protocol
Device(config-track)# exit
Device(config)# track 100 list boolean and
Device(config-track)# object 1
Device(config-track)# object 2 not
track interface
To track an interface and to enter tracking configuration mode, use the track interface command in global configuration mode. To remove the tracking, use the no form of this command.
track object-number interface [ carrier-delay | delay | endpoint-tracker | interface | ip | ipv6 | list | service | stub-object | threshold ] [ line-protocol | ip routing | ipv6 routing ]
no track object-number
Syntax Description
object-number
Specifies the object number that represents the interface to be tracked. The range is from 1–1000.
[carrier-delay | delay | endpoint-tracker | interface | ip | ipv6 | list | service | stub-object | threshold ]
(Optional) Specifies the interface type to be tracked.
line-protocol
Tracks the state of the interface line protocol.
ip routing
Tracks whether IP routing is enabled, whether an IP address is configured on the interface, and whether the interface state is up before reporting to the tracking client that the interface is up.
ipv6 routing
Tracks whether IPv6 routing is enabled, whether an IPv6 address is configured on the interface, and whether the interface state is up before reporting to the tracking client that the interface is up.
Command Default
No interface is tracked.
Command Modes
Global configuration (config)
Command History
Release
Modification
Cisco IOS XE Release 17.7.1a
This command was introduced.
Usage Guidelines
For usage guidelines, see the Cisco IOS XE track interface command.
The following example shows how to configure the tracking process to track the IP-routing capability of serial interface 1/0:
Device(config)# track 1 interface serial1/0 ip routing
Device(config-track)# exit
The following example shows how to configure the tracking process to track the IPv6-routing capability of a GigabitEthernet interface 1/0/0:
Device(config)# track 1 interface GigabitEthernet 1/0/0 ipv6 routing
Device(config-track)# exit
The following example shows how to configure two tracker and adding them to the track list using the boolean 'and' operation:
Device# config-transaction
Device(config)# track 100 interface GigabitEthernet2 line-protocol
Device(config-track)# exit
Device(config)# track 200 interface GigabitEthernet3 line-protocol
Device(config-track)# exit
Device(config)# track 400 list boolean and
Device(config-track)# object 100
Device(config-track)# object 200
Device(config-track)# exit
track list
To specify a list of objects to be tracked and the thresholds to be used for comparison, use the track list command in global configuration mode. To disable the tracked list, use the no form of this command.
track object-number list {boolean {and | | or} | threshold {weight | | percentage}}
no track object-number list {boolean {and | or} | threshold {weight | percentage}}
Syntax Description
object-number
Object number of the object to be tracked. The range is from 1–1000.
boolean
State of the tracked list is based on a boolean calculation. The keywords are as follows:
and : Specifies that the list is “up” if all objects are up, or “down” if one or more objects are down. For example when tracking two interfaces, “up” means that both interfaces are up, and “down” means that either interface is down.
or : Specifies that the list is “up” if at least one object is up. For example, when tracking two interfaces, “up” means that either interface is up, and “down” means that both interfaces are down.
threshold
State of the tracked list is based on a threshold. The keywords are as follows:
percentage : Specifies that the threshold is based on a percentage.
weight : Specifies that the threshold is based on a weight.
Command Default
The object list is not tracked.
Command Modes
Global configuration (config)
Command History
Release
Modification
Cisco IOS XE Release 17.7.1a
This command was introduced.
Usage Guidelines
For usage guidelines, see the Cisco IOS XE track list command.
The following example shows how to configure a track list object to track two GigabitEthernet interfaces:
Device(config)# track 1 interface GigabitEthernet2 line-protocol
Device(config-tracker)# exit
Device(config)# track 2 interface GigabitEthernet3 line-protocol
Device(config-tracker)# exit
Device(config)# track 100 list boolean and
Device(config-tracker)# object 1
Device(config-tracker)# object 2
Device(config-tracker)# exit
The following configurations provide some hysteresis in case one of the serial interfaces is flapping.
The following example shows how to configure a track list object to track two serial interfaces when both serial interfaces are “up” and when either serial interface is “down”:
Device(config)# track 1 interface serial2/0 line-protocol
Device(config-track)# exit
Device(config)# track 2 interface serial2/1 line-protocol
Device(config-track)# exit
Device(config)# track 100 list boolean and
Device(config-track)# object 1
Device(config-track)# object 2
The following example shows how to configure a track list object to track two serial interfaces when either serial interface is “up” and when both serial interfaces are “down”:
Device(config)# track 1 interface serial2/0 line-protocol
Device(config-track)# exit
Device(config)# track 2 interface serial2/1 line-protocol
Device(config-track)# exit
Device(config)# track 101 list boolean or
Device(config-track)# object 1
Device(config-track)# object 2
The following example shows how to configure a track list object to track two serial interfaces when both serial interfaces are “up” and when both serial interfaces are “down,” for example:
Device(config)# track 1 interface serial2/0 line-protocol
Device(config-track)# exit
Device(config)# track 2 interface serial2/1 line-protocol
Device(config-track)# exit
Device(config)# track 102 threshold weight
Device(config-track)# object 1 weight 10
Device(config-track)# object 2 weight 10
Device(config-track)# threshold weight up 20 down 0
track (VRRP)
To enable an object to be tracked using a Virtual Router Redundancy Protocol version 3 (VRRPv3) group, use the track command in VRRP configuration mode. To disable the tracking, use the no form of this command.
track object-number { shutdown | | [ decrement priority ] }
no track object-number shutdown
Syntax Description
object-number
Object number representing the interface to be tracked. The range is from 1–1000.
shutdown
Shuts down the VRRPv3 group.
decrement priority
Sets the priority value by which the VRRP group is reduced if the tracked object state on serial interface VRRPv3 goes down. The valid range is 1–255.
Command Default
Tracking an object using a VRRPv3 group isn't enabled.
Command Modes
VRRP configuration (config-if-vrrp)
Command History
Release
Modification
Cisco IOS XE Release Amsterdam 17.2.1v
Qualified for use in Cisco SD-WAN Manager CLI templates.
Usage Guidelines
For the usage guidelines, see track (VRRP).
The following example shows how to configure VRRPv3 group shutdown:
Device(config)# interface GigabitEthernet1
Device(config-if)# vrrp 2 address-family ipv4
Device(config-if-vrrp)# track 2 shutdown
The following example shows how to configure the tracking process to track the state of the IPv6 object using the VRRPv3 group. VRRP on GigabitEthernet interface 0/0/0 registers with the tracking process to be informed of any changes to the IPv6 object on the VRRPv3 group. If the IPv6 object state on serial interface VRRPv3 goes down, then the priority of the VRRP group is reduced by 20:
Device(config)# fhrp version vrrp v3
Device(config)# interface GigabitEthernet 0/0/0
Device(config-if)# vrrp 1 address-family ipv6
Device(config-if-vrrp)# track 1 decrement 20
The following example shows how to configure the tracking process to track the state of the IPv4 object. VRRP on GigabitEthernet2 registers with the tracking process to be informed of any changes to the IPv4 object. If the IPv4 object state on interface goes down, then the priority of the VRRP group is reduced by 10:
Device(config)# interface GigabitEthernet2
Device(config-if)# ip address 10.10.1.1 255.255.255.0
Device(config-if)# negotiation auto
Device(config-if)# vrrp 1 address-family ipv4
Device(config-if-vrrp)# address 10.10.1.10 primary
Device(config-if-vrrp)# track 400 decrement 10
Device(config-if-vrrp)# tloc-change increase-preference 1
Device(config-if-vrrp)# exit
track service
To configure track list and tracking for SIG containers, use the track service command in global configuration mode. To disable the configuration, use the no form of this command.
track object-number service string
no track track-number service
Syntax Description
string
(Optional)
object-number
Specifies the object number that represents the interface to be tracked. The range is from 1–1000.
Command Default
Command Modes
Global configuration (config)
Command History
Release
Modification
Cisco IOS XE Release 17.7.1a
This command was introduced.
Usage Guidelines
The following example shows how to configure track list and tracking for SIG containers:
Device(config)# track 1 service global
Device(config-track)# exit
Device(config)# track 2 service global
Device(config-track)# exit
Device(config)# track 3 list boolean and
Device(config-track)# object 100
Device(config-track)# object 200
Device(config-track)# exit
tloc-change increase-preference
To configure tloc-change preference value, use the tloc-change increase-preference command in VRRP interface configuration mode. To disable the configuration, use the no form of this command.
tloc-change increase-preference value
no tloc-change
Syntax Description
value
Specifies the TLOC change preference configuration under VRRP group. The value increases by one when a node becomes the primary node.
Range: 1–4294967295.
Command Default
Command Modes
VRRP Interface configuration (config-if-vrrp)
Command History
Release
Modification
Cisco IOS XE Release 17.7.1a
This command was introduced.
Usage Guidelines
The default value for tloc-change increase-preference value is one.
We recommend that you use the same TLOC preference value for all TLOCs in a site. For a Cisco vEdge device, the default TLOC preference for the tunnel interface can be modified irrespective of whether VRRP is configured or not. However, if you want to use the VRRP tracking feature and utilize the advantage of TLOC preference values for VRRP tracking, ensure that the default tunnel preference is same on both the VRRP routers.
The following example shows how to configure TLOC change preference value:
Device(config)# interface GigabitEthernet2
Device(config-if)# vrf forwarding 1
Device(config-if)# ip address 10.10.1.1 255.255.255.0
Device(config-if)# negotiation auto
Device(config-if)# vrrp 1 address-family ipv4
Device(config-if-vrrp)# address 10.10.1.10 primary
Device(config-if-vrrp)# track 400 decrement 10
Device(config-if-vrrp)# tloc-change increase-preference 1
Device(config-if-vrrp)# exit
vrf forwarding
To associate a VRF instance or a virtual network with an interface or subinterface, use the vrf forwarding command in interface configuration mode. To disassociate a VRF or virtual network from an interface or subinterface, use the no form of this command.
vrf forwarding vrf-name
no vrf forwarding vrf-name
Syntax Description
vrf-name
The VRF name to be associated with the specified interface.
Command Default
The default for an interface is the global routing table.
Command Modes
Interface configuration (config-if)
Command History
Release
Modification
Cisco IOS XE Release 17.2.1v
Qualified for use in Cisco vManage CLI templates.
Usage Guidelines
For the usage guidelines, see vrf forwarding.
Device(config)# interface GigabitEthernet 1
Device(config-if)# vrf forwarding vrf1
vrrp address-family
To create a VRRP group and to enter VRRP configuration mode, use the vrrp address-family command in interface configuration mode. To remove the VRRP group, use the no form of this command.
vrrp group address-family { ipv4 | ipv6 }
no vrrp group address-family { ipv4 | ipv6 }
Syntax Description
group
VRRP group number ranges from 1 to 255.
ipv4
Enter VRRP IPv4 address-family configuration.
ipv6
Enter VRRP IPv6 address-family configuration.
Command Default
None
Command Modes
Interface configuration (config-if)
Command History
Release Modification
Cisco IOS XE Release 17.2.1v
Command qualified for use in Cisco SD-WAN Manager CLI templates.
Usage Guidelines
Use the vrrp address-family command to create a VRRP group and to enter VRRP configuration mode. VRRP is the only FHRP (First Hop Redundancy Protocol) supported by Cisco Catalyst SD-WAN edge routers in controller mode. Once you create the group and specify the address-family, you can configure different settings for VRRP.
The following example creates and customizes VRRP group 3:
Device# config-transaction
Device(config)# int GigabitEthernet0/0/2
Device(config-if)# vrrp 3 address-family ipv4
Table 1. Related Commands
Command
Description
address primary (VRRP)
Configures a primary IP address for VRRP.
Was this Document Helpful?
Yes No
Feedback
Customers Also Viewed
Identify vEdge Certificate Expired on May 9, 2023
Cisco SD-WAN Getting Started Guide --- Install and Upgrade Cisco IOS XE Release 17.2.1r and Later
Cisco SD-WAN Getting Started Guide --- Cisco SD-WAN Overlay Network Bring-Up Process
+ Show 3 More
Contact Cisco
Open a Support Case
(Requires a Cisco Service Contract)