Configuration Guides
Configuring the Cisco RFGW-10 DS-48 Line Cards
Save
Download
Print

Updated:December 30, 2012
Bias-Free Language
Table of Contents
Configuring the Cisco RFGW DS-48 Universal EQAM Line Cards
Finding Feature Information
Contents
Information About Cisco DS48 Line Card
Administratively Shutting Down and Restarting a QAM Interface
How to Configure Universal EQAM
Activating Downstream QAM
Verifying the Downstream QAM
Setting the Stacking Level to Enable QAM Channels
Example
Verifying the Downstream Stacking
Enabling the RF Output on the Integrated Upconverter
Example
Setting the Downstream Annex Type
Example
Verifying the Downstream Annex Type
Assigning a TSID to the QAM Channel
Example
Verifying the Downstream TSID
Setting the Downstream Frequency on the QAM Channel
Example
Verifying the Downstream Frequency
Generating a Standard Test Signal on the QAM Subinterface
Example
Setting the FEC Interleaver Level and Depth Values
Example
Verifying the Downstream Interleaver-level
Verifying the Downstream Interleaver Depth
Setting the Modulation Format on the QAM Subinterface
Example
Verifying the Downstream Modulation Format
Setting the Power Level on the QAM Subinterface
Example
Verifying the Downstream RF power
Locking the QAM Subinterface
Example
Displaying RF Parameters Set on Line Cards
Additional References
Related Documents
Standards
MIBs
RFCs
Technical Assistance
Feature Information for Universal EQAM
Glossary
Configuring the Cisco RFGW DS-48 Universal EQAM Line Cards
First Published: January 8, 2009
Last Updated: August 7, 2015
  The Cisco RF Gateway 10 (RFGW-10) operates as an Universal Edge Quadrature Amplitude Modulation (UEQAM) that supports both Data Over Cable Service Interface Specification (DOCSIS) and Video applications.
The Cisco RFGW-10 DS48 line card is a 12-port, 48-channel Universal EQAM card designed to support Downstream External PHY Interface (DEPI) DOCSIS MPEG Transport (D-MPT), downstream data traffic, and MPEG video traffic for video-on-demand (VoD), switched digital video (SDV), and Broadcast Video applications. The DS48 card is similar to the traditional QAM solutions where the card receives encapsulated data, depacketizes or reformats the packets, maps them to the output QAM channel, and performs QAM modulation and frequency upconversion. From a high level, the DS48 line card receives video and DOCSIS data encapsulated over Ethernet and outputs analog QAM data to the subscriber devices (STB and DOCSIS modems).
Finding Feature Information
Your software release may not support all the features documented in this module. For the latest feature information and caveats, see the release notes for your platform and software release. To find information about the features documented in this module, and to see a list of the releases in which each feature is supported, see the “Feature Information for Universal EQAM” section.
Use Cisco Feature Navigator to find information about platform support and Cisco IOS, Catalyst OS, and Cisco IOS XE software image support. To access Cisco Feature Navigator, go to http://www.cisco.com/go/cfn. An account on Cisco.com is not required.
Contents
Information About Cisco DS48 Line Card
Administratively Shutting Down and Restarting a QAM Interface
How to Configure Universal EQAM
Additional References
Feature Information for Universal EQAM
Glossary
Information About Cisco DS48 Line Card
The DS48 line card has 12 physical RF ports, which support up to four QAMs per port. The number of QAM outputs is configurable on a per-port basis (meaning an individual port can support one, two, or four QAMs as well as muting of individual QAMs within a QAM group). In stacked QAM mode, the QAMs are stacked contiguously over a 24 MHz or 32 MHz band. The line card supports a downstream channel frequency range of 88 MHz to 870 MHz.
  Table 1 DOCSIS and EuroDOCSIS Downstream Rates
Downstream
Channel Width,
MHz
Modulation
Scheme,
bit/symbol
Baud Rate,
MSym/sec
Raw Bit Rate,
Mb/sec
Throughput (Bit
Rate - Overhead),
Mb/sec
6
64 QAM (6)
256 QAM (8)
5.056
5.360
30.34
42.88
27
38
8
64 QAM (6)
256 QAM (8)
6.952
6.952
41.71
55.62
37
48
The DS48 line card supports redundancy and high availability support. The line card is designed to detect and react to a wide range of faults and failures, and respond with sub-second failover to a dedicated standby card. In the Cisco RFGW-10 platform, DS48 line cards can be configured with 1:N redundancy (up to 1:9), resulting in a fully-protected, high capacity, and highly dense EQAM solution.
The QAM interface supports downstream and upstream signals. The downstream signal is an intermediate-frequency (IF) signal that is suitable for use with an external upconverter. Your cable plant, combined with your planned and installed subscriber base, service offering, and external network connections, determines what combination of Cisco RFGW-10 cable interfaces, network uplink line cards, and other components that you should use.
For information on configuring features on the Cisco RFGW 10 DS48 line card, see:
How to Configure Universal EQAM
Related Documents
Administratively Shutting Down and Restarting a QAM Interface
You can disable a QAM interface by shutting it down. Shutting down an interface disables all functions on the specified interface and marks the interface as unavailable on the display of all monitoring commands.One reason to shut down an interface is if you want to change the electrical interface type or mode of a port online. This information is communicated to other network servers through all dynamic routing protocols. You replace the serial adapter cable, for example, and use software commands to restart the interface, and if necessary, to reconfigure the port for the new interface. The interface is not featured in any routing updates. On serial interfaces, shutting down an interface causes the dedicated Token Ring (DTR) signal to be dropped. On Token Ring interfaces, shutting down an interface causes the interface to exit from the ring. On Fiber Distributed Data Interfaces (FDDIs), shutting down an interface causes the optical bypass switch, if present, to go into bypass mode.
To shut down an interface and then restart it, use the following commands in interface configuration mode:
shutdown —shuts down an interface
no shutdown —enables an interface that has been disabled
To check whether an interface is disabled, use the show interfaces command in Privileged EXEC mode. An interface that is shut down is shown as administratively down in the show interfaces command display.
At system startup or restart, the Fast Serial Interface Processor (FSIP) polls the interfaces and determines the electrical interface type of each port (according to the type of port adapter cable attached). However, it does not necessarily poll an interface again when you change the adapter cable online.
To ensure that the system recognizes the new interface type, shut down the interface using the shutdown command, and enable the interface after changing the cable. Refer to your hardware documentation for more details.
How to Configure Universal EQAM
This section describes how to configure Universal EQAM in Cisco RFGW-10 UEQAM:
Activating Downstream QAM
Setting the Stacking Level to Enable QAM Channels
Enabling the RF Output on the Integrated Upconverter
Setting the Downstream Annex Type
Assigning a TSID to the QAM Channel
Setting the Downstream Frequency on the QAM Channel
Generating a Standard Test Signal on the QAM Subinterface
Setting the FEC Interleaver Level and Depth Values
Setting the Modulation Format on the QAM Subinterface
Setting the Power Level on the QAM Subinterface
Locking the QAM Subinterface
Displaying RF Parameters Set on Line Cards
Activating Downstream QAM
To activate a downstream port on a Cisco RFGW-10 QAM interface card for digital data transmissions over the HFC network, complete the steps in the following table.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot / port.channel
4. cable downstream rf-shutdown
5. no cable downstream rf-shutdown
6. no shutdown
7. end
DETAILED STEPS
    Command
Purpose
Step 1
enable
  Router> enable
Enters enable (privileged EXEC) mode.
Enter the password.
You have entered privileged EXEC mode when the prompt displays the pound symbol (#).
Step 2
configure terminal
  Router# configure terminal
Router(config)#
Enters global configuration mode.
Step 3
interface qam slot/port.channel
  Router(config)# interface qam 3/12.4
Router(config-if)#
Enters QAM interface configuration mode.
slot—RF line card slot, from 3 to 12
port—Downstream QAM port on the RF line card, from 1 to 12
channel—Downstream QAM channel within the QAM port, from 1 to 4.
Note If the line card is part of the line card redundancy (LCRED) configuration, use qam-red instead of qam for both the interfaces and ports.
Step 4
cable downstream rf-shutdown
    Router(config-if)# cable downstream rf-shutdown
Router(config-if)# no cable downstream rf-shutdown
Disables the RF output from an integrated upconverter on a Cisco RFGW-10.
Step 5
no cable downstream rf-shutdown
  Router(config-subif)# no cable downstream rf-shutdown
Enables the RF output on the integrated upconverter.
Step 6
no shutdown
  Router(config-if)# no shutdown
Places the downstream port in the “admin up” state.
Step 7
end
  Router(config-if)# end
Returns to privileged EXEC mode.
Verifying the Downstream QAM
To verify and determine if the downstream carrier is active (up), enter the show controllers qam command for the downstream port that you just configured. The following example is a sample output of a downstream QAM interface:
Router# show controllers qam 3/1 downstream
  Load for five secs: 12%/0%; one minute: 14%; five minutes: 15%
Time source is NTP, 01:08:51.635 PST Wed Nov 5 2008
  Qam3/1.1 Downstream is up
Annex B, Stacking set to 4
Frequency: 297000000 Hz, Power: 45.0 dBmV
Modulation: 256QAM, TSID: 0, QAM IDB_State: UP
Bandwidth Reserved for Video: 0 bps
Bandwidth Used: 1614968 bps
Bandwidth Total: 38810000 bps
Transport Mode: QAM_MODE_MPT Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
  Perform these steps if you experience difficulty with verification:
Step 1 Ensure that the cable connections are not loose or disconnected.
Step 2 Ensure that the QAM interface line card is firmly inserted in its chassis slot.
Step 3 Ensure that the captive installation screws are tight.
Step 4 Verify that you have entered the correct slot and port numbers.
Setting the Stacking Level to Enable QAM Channels
This section describes how to configure frequency stacking. Configuring the stacking level affects all channels within an RF port. The default stacking level value is 1:4.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port
4. cable downstream stacking stacking
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port
  Router(config)# interface qam 3/1
Enters the RF port mode.
slot—RF line card slot, from 3 to 12
port—Downstream QAM port on the RF line card, from 1 to 12.
Step 4
cable downstream stacking stacking
  Router(config)# cable downstream stacking 4
Configures the stacking level. Stacking level can be 1, 2, or, 4.
QAM channel 1 is enabled on the specified rf-port for stacking level 1.
QAM channels 1, and 2 are enabled on the specified rf-port for stacking level 2.
QAM channels 1, 2, 3, and 4 are enabled on the specified rf-port for stacking level 4.
Example
The following example shows how to configure the downstream channel on the cable interface for frequency stacking of 4.
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1
Router(config-if)# cable downstream stacking 4
Verifying the Downstream Stacking
To verify the downstream stacking level set on the QAM, enter the show controllers qam command for the downstream port you just configured. See the following example:
Router# show controllers qam 3/1.1 downstream
  Load for five secs: 12%/0%; one minute: 14%; five minutes: 15%
Time source is NTP, 01:08:51.635 PST Wed Nov 5 2008
  Qam3/1.1 Downstream is up
Annex B, Stacking set to 4
Frequency: 297000000 Hz, Power: 45.0 dBmV
Modulation: 256QAM, TSID: 0, QAM IDB_State: UP
Bandwidth Reserved for Video: 0 bps
Bandwidth Used: 1614968 bps
Bandwidth Total: 38810000 bps
Transport Mode: QAM_MODE_MPT Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
Enabling the RF Output on the Integrated Upconverter
This section describes how to enable RF output on an integrated upconverter.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port[.channel]
4. no cable downstream rf-shutdown
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port[.channel]
  Router(config)# interface qam 3/1
Enters the port or the subinterface mode.
slot is the RF line card slot, from 3 to 12, Port is a downstream QAM port on the RF line card, from 1 to 12 and Channel is a downstream QAM channel within the QAM port, from 1 to 4.
Step 4
no cable downstream rf-shutdown
  Router(config-if)# no cable downstream rf-shutdown
Enables the integrated upconverter.
Note If the command is executed on the RF port, such as interface qam3/1, it is equivalent to executing the command on all the QAM channels (1/2/4 depending on the stacking level set) on that port.
Example
The following example shows how the integrated upconverter on the Cisco RFGW-10 UEQAM is enabled:
Router(config)# configure terminal
Router(config-if)# interface qam 3/1.1
Router(config-subif)# no cable downstream rf-shutdown
Setting the Downstream Annex Type
This section describes how to set the Moving Picture Experts Group (MPEG) framing format for a downstream port on a cable interface line card to either Annex A (Europe) Euro-DOCSIS J.112, Annex B (North America) ITU J.83, or Annex C (Japan).
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port
4. cable downstream Annex {A | B | C}
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port
  Router(config)# interface qam 3/1
Enters the port mode.
slot is the RF line card slot, from 3 to 12 and Port is a downstream QAM port on the RF line card, from 1 to 12.
Step 4
cable downstream Annex {A | B | C}
  Router(config-if)# cable downstream Annex A
Configures the MPEG framing format for a downstream port.
Annex A is Euro-DOCSIS J.112 (Europe), Annex B is ITU J.83 (North America), and Annex C is for Japan.
The default is Annex B for all Cisco cable interface line cards.
Note The Annex mode is a port level configuration and changing it on any QAM channel on the port affects all the other QAM channels on that port.
Note For Annex A, a maximum of 36 QAMs can be used on a Cisco RFGW-10 DS-48 Line Card running on Cisco RFGW-10 Supervisor Engine V-10GE.
Note DS-48 line card have 12 ports. For Annex A mode, user can use only 18 QAMs in the first six ports, and use remaining 18 QAMs in the other six ports. If user configures more than 18 QAMs in the first/second 6 ports, below warning message will be shown: WARNING: Total Annex A limit [18 QAMs] on internal gig - 1 [port 1 to 6 - 1st Gig; port 7 to 12 - 2nd Gig] is exceeded on slot 4. This may cause oversubscription.
Example
The following example shows how to set the MPEG framing format to Annex B on the Cisco RFGW-10 UEQAM:
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1
Router(config-if)# cable downstream Annex B
Verifying the Downstream Annex Type
To verify the downstream MPEG framing format setting, enter the show controllers qam command for the downstream port you have just configured. See the following example:
Router#show controllers qam 3/1.1 downstream
Load for five secs: 12%/0%; one minute: 14%; five minutes: 15%
Time source is NTP, 01:08:51.635 PST Wed Nov 5 2008
  Qam3/1.1 Downstream is up
Annex B, Stacking set to 4
Frequency: 297000000 Hz, Power: 45.0 dBmV
Modulation: 256QAM, TSID: 0, QAM IDB_State: UP
Bandwidth Reserved for Video: 0 bps
Bandwidth Used: 1614968 bps
Bandwidth Total: 38810000 bps
Transport Mode: QAM_MODE_MPT Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
Assigning a TSID to the QAM Channel
This section describes how to configure the Transport Stream Identifier (TSID) for the QAM subinterface.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port.channel
4. cable downstream tsid id
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port.channel
  Router(config)# interface qam 3/1.1
Enters the subinterface mode.
slot is the RF line card slot, from 3 to 12, Port is a downstream QAM port on the RF line card, from 1 to 12 and Channel is a downstream QAM channel within the QAM port, from 1 to 4.
Step 4
cable downstream tsid id
  Router(config-if)# cable downstream tsid 44
Configures the TSID for the QAM subinterface.
This unique ID identifies a QAM channel in the cable headend. The valid ID range is 0 to 65535.
Note Duplicate TSID are not accepted.
Example
The following example shows how to configure the downstream channel on the cable interface with a TSID of 44:
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1.1
Router(config-subif)# cable downstream tsid 44
Verifying the Downstream TSID
To verify the downstream TSID value on the QAM, enter the show controllers qam command for the downstream port you just configured. See the following example:
Router#show controllers qam 3/1.1 downstream
Load for five secs: 12%/0%; one minute: 14%; five minutes: 15%
Time source is NTP, 01:08:51.635 PST Wed Nov 5 2008
  Qam3/1.1 Downstream is up
Annex B, Stacking set to 4
Frequency: 297000000 Hz, Power: 45.0 dBmV
Modulation: 256QAM, TSID: 0, QAM IDB_State: UP
Bandwidth Reserved for Video: 0 bps
Bandwidth Used: 1614968 bps
Bandwidth Total: 38810000 bps
Transport Mode: QAM_MODE_MPT Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
  Setting the Downstream Frequency on the QAM Channel
This section describes how to set the downstream center frequency for the cable interface line card to reflect the digital carrier frequency of the downstream radio frequency carrier (the channel) in the downstream QAM channel.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port.channel
4. cable downstream frequency frequency
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port.channel
  Router(config)# interface qam 3/1.1
Enters the subinterface mode.
slot is the RF line card slot, from 3 to 12, Port is a downstream QAM port on the RF line card, from 1 to 12 and Channel is a downstream QAM channel within the QAM port, from 1 to 4.
Step 4
cable downstream frequency frequency
  Router(config-if)# cable downstream frequency 520000000
Configures the downstream center frequency for the cable interface line card.
The frequency is QAM channel frequency in Hz. On cable interfaces with an integrated upconverter, to reset the downstream frequency and disable the RF output from the integrated upconverter, use the no form of this command.
Example
The following example shows how to set the downstream center frequency display value on the Cisco RFGW-10 UEQAM:
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1.1
Router(config-subif)# cable downstream frequency 520000000
Verifying the Downstream Frequency
To verify the downstream frequency on the QAM, enter the show controllers qam command for the downstream port you just configured. See the following example:
Router#show controllers qam 3/1 downstream
Load for five secs: 12%/0%; one minute: 14%; five minutes: 15%
Time source is NTP, 01:08:51.635 PST Wed Nov 5 2008
  Qam3/1.1 Downstream is up
Annex B, Stacking set to 4
Frequency: 520000000 Hz, Power: 45.0 dBmV
Modulation: 256QAM, TSID: 0, QAM IDB_State: UP
Bandwidth Reserved for Video: 0 bps
Bandwidth Used: 1614968 bps
Bandwidth Total: 38810000 bps
Transport Mode: QAM_MODE_MPT Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
  Generating a Standard Test Signal on the QAM Subinterface
This section describes how to activate a downstream port on a cable interface, and generate either a standard modulated signal or a test signal.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port.channel
4. cable downstream if-output continuous-wave
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port.channel
  Router(config)# interface qam 3/1.1
Enters the subinterface mode.
slot is the RF line card slot, from 3 to 12, Port is a downstream QAM port on the RF line card, from 1 to 12 and Channel is a downstream QAM channel within the QAM port, from 1 to 4.
Step 4
cable downstream if-output continuous-wave
  Router(config-if)# cable downstream if-output continuous-wave
Activates a downstream port on a cable interface.
When using the continuous-wave keyword, output is an unmodulated continuous sine wave on the downstream, shutting down normal data network operations.
To disable all signal output on the intermediate frequency (IF) carrier, and shut down the interface, use the no form of this command.
Example
The following example shows how to enable downstream on QAM interface 3 on the Cisco RFGW-10 UEQAM:
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1.1
Router(config-subif)# cable downstream if-output continuous-wave
Setting the FEC Interleaver Level and Depth Values
This section describes how to modify the Interleaver depth and level on the downstream radio frequency carrier (the channel) for the downstream QAM channel.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port.channel
4. cable downstream interleaver-level {1 | 2}
5. cable downstream interleaver-depth depth
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port.channel
  Router(config)# interface qam 3/1.1
Enters the subinterface mode.
slot is the RF line card slot, from 3 to 12, Port is a downstream QAM port on the RF line card, from 1 to 12 and Channel is a downstream QAM channel within the QAM port, from 1 to 4.
Step 4
cable downstream interleaver-level {1 | 2}
  Router(config-subif)# cable downstream interleaver-level 1
Configures the interleaver-level.
The default interleaver level is 2.
Note This command is for Annex B only.
Step 5
cable downstream interleaver-depth depth
  Router(config-subif)# cable downstream interleaver-depth 4
Configures the interleaver-depth.
Note This command is for Annex B only.
As you can configure various combinations of the I/J values for Annex B, the input for this command is the fee-code that is derived from the I/J values. The default I/J values are 32/4.
Example
The following example shows how to configure the downstream interleaver level to 2 on the Cisco RFGW-10 UEQAM:
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1.1
Router(config-if)# cable downstream interleaver-level 2
  The following example shows how to configure the downstream FEC I/J values to 32/4:
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1.1
Router(config-subif)# cable downstream interleaver-depth 8
Verifying the Downstream Interleaver-level
To verify the downstream interleaver-level on the QAM, enter the show controllers qam command for the downstream port you just configured. See the following example:
Router# show controllers qam 3/1 downstream
  Load for five secs: 12%/0%; one minute: 14%; five minutes: 15%
Time source is NTP, 01:08:51.635 PST Wed Nov 5 2008
  Qam3/1.1 Downstream is up
Annex B, Stacking set to 4
Frequency: 297000000 Hz, Power: 45.0 dBmV
Modulation: 256QAM, TSID: 0, QAM IDB_State: UP
Bandwidth Reserved for Video: 0 bps
Bandwidth Used: 1614968 bps
Bandwidth Total: 38810000 bps
Transport Mode: QAM_MODE_MPT Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
  Verifying the Downstream Interleaver Depth
To verify the downstream interleave depth setting, enter the show controllers qam command for the downstream port you have just configured:
Router# show controllers qam 3/1 downstream
  Load for five secs: 12%/0%; one minute: 14%; five minutes: 15%
Time source is NTP, 01:08:51.635 PST Wed Nov 5 2008
  Qam3/1.1 Downstream is up
Annex B, Stacking set to 4
Frequency: 297000000 Hz, Power: 45.0 dBmV
Modulation: 256QAM, TSID: 0, QAM IDB_State: UP
Bandwidth Reserved for Video: 0 bps
Bandwidth Used: 1614968 bps
Bandwidth Total: 38810000 bps
Transport Mode: QAM_MODE_MPT Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
Setting the Modulation Format on the QAM Subinterface
This section describes how to set the modulation format for a downstream port on a cable interface line card.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port.channel
4. cable downstream modulation {64qam | 256qam}
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port.channel
  Router(config)# interface qam 3/1.1
Enters the subinterface mode.
slot is the RF line card slot, from 3 to 12, Port is a downstream QAM port on the RF line card, from 1 to 12 and Channel is a downstream QAM channel within the QAM port, from 1 to 4.
Step 4
cable downstream modulation {64qam | 256qam}
  Router(config-subif)# cable downstream modulation 256qam
Configures the modulation format for a downstream port on a cable interface line card.
If you change the modulation format, the interface is shut down and all the cable modems are disconnected. The default modulation is set to 64 QAM on all the cable interface cards.
Example
The following example shows how to set the downstream modulation to 256 QAM, implying the downstream data speed. In 256 QAM, the modulation rate is 8 bits per downstream symbol.
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1.1
Router(config-subif)# cable downstream modulation 64qam
Verifying the Downstream Modulation Format
To verify the downstream modulation rate setting, enter the show controllers qam command for the downstream port you just configured. See the following example:
Router# show controllers qam 3/1.1 downstream
  Load for five secs: 12%/0%; one minute: 14%; five minutes: 15%
Time source is NTP, 01:08:51.635 PST Wed Nov 5 2008
  Qam3/1.1 Downstream is up
Annex B, Stacking set to 4
Frequency: 297000000 Hz, Power: 45.0 dBmV
Modulation: 256QAM, TSID: 0, QAM IDB_State: UP
Bandwidth Reserved for Video: 0 bps
Bandwidth Used: 1614968 bps
Bandwidth Total: 38810000 bps
Transport Mode: QAM_MODE_MPT Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
Setting the Power Level on the QAM Subinterface
This section describes how to set the RF power output level on an integrated upconverter on the Cisco RFGW-10 UEQAM line card.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port.channel
4. cable downstream rf-power power
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port.channel
  Router(config)# interface qam 3/1.1
Enters the subinterface mode.
slot is the RF line card slot, from 3 to 12, Port is a downstream QAM port on the RF line card, from 1 to 12 and Channel is a downstream QAM channel within the QAM port, from 1 to 4.
Step 4
cable downstream rf-power power
  Router(config-subif)# cable downstream rf-power 50
Configures the RF power output level on an integrated upconverter.
The power variable is the RF power value in tenth of a dBmV. To reset the RF output power level to its default value, use the no form of this command.
Example
The following example shows the integrated upconverter on the Cisco RFGW-10 line card being configured for an RF output power level of 50 dBmV:
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1.1
Router(config-subif)# cable downstream rf-power 50
  Verifying the Downstream RF power
To verify the downstream RF power on the QAM, enter the show controllers qam command for the downstream port you just configured. See the following example:
Router#show controllers qam 3/1.1 downstream
Load for five secs: 12%/0%; one minute: 14%; five minutes: 15%
Time source is NTP, 01:08:51.635 PST Wed Nov 5 2008
  Qam3/1.1 Downstream is up
Annex B, Stacking set to 4
Frequency: 297000000 Hz, Power: 45.0 dBmV
Modulation: 256QAM, TSID: 0, QAM IDB_State: UP
Bandwidth Reserved for Video: 0 bps
Bandwidth Used: 1614968 bps
Bandwidth Total: 38810000 bps
Transport Mode: QAM_MODE_MPT Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
Locking the QAM Subinterface
This section describes how to lock a downstream port on a cable interface line card.
SUMMARY STEPS
1. enable
2. configure terminal
3. interface qam slot/port.channel
4. cable downstream lock
DETAILED STEPS
Command or Action
Purpose
Step 1
enable
  Router> enable
Enables privileged EXEC mode.
Enter your password if prompted.
Step 2
configure terminal
  Router# configure terminal
Enters global configuration mode.
Step 3
interface qam slot/port.channel
  Router(config)# interface qam 3/1.1
Enters the subinterface mode.
slot is the RF line card slot, from 3 to 12, Port is a downstream QAM port on the RF line card, from 1 to 12 and Channel is a downstream QAM channel within the QAM port, from 1 to 4.
Step 4
cable downstream lock
  Router(config-subif)# cable downstream lock
Locks a downstream port on a cable interface line card.
Set this lock to prohibit users from modifying any RF parameters on that QAM channel. If the lock is set at the port level, then all the QAM channels on that port are locked.
Example
The following example shows how to set the downstream lock on QAM interface 3 on the Cisco RFGW-10 UEQAM:
Router> enable
Router# configure terminal
Router(config)# interface qam 3/1.1
Router(config-subif)# cable downstream lock
Displaying RF Parameters Set on Line Cards
To display RF information set using the cable downstream configuration commands on the cable interface, use the following command in privileged EXEC mode:
Router# show controllers qam slot/port.channel [downstream]
  The following is sample output of downstream configuration on a redundancy line card:
Router# show controllers qam 3/1.2 downstream
Qam3/1.2 Downstream is down
Annex B, Stacking set to 4
Frequency: 507000000 Hz, Power: 44 dBmV
Modulation: 64QAM, TSID: 0, State: LCC_QAM_STATE_DOWN
Bandwidth Reserved: 0 bps
Bandwidth Unreserved: 26970000 bps
Bandwidth Total: 26970000 bps
Transport Mode: QAM_MODE_OFF Qam Owner: LOCAL
Interleave Level: 2, FEC I: 32 FEC J: 4
Additional References
The following sections provide references related to configuring the Cisco RFGW DS48 UEQAM line card with other supported software features:
Related Documents
Related Topic
Document Title
Bundle Image Upgrade—allows efficient upgrade of multiple devices simultaneously by programming them with a new image.
http://www.cisco.com/en/US/docs/cable/rf_gateway/feature/guide/
rfgw10_bundledimg_upg.html
Alarm and Event Management—provides information about previous and current events in the system.
http://www.cisco.com/en/US/docs/cable/rf_gateway/feature/guide/
rfgw10_alrm_evt_mgmt.html
DOCSIS Timing Interface (DTI) Offset—enables DOCSIS timing offset adjustment.
http://www.cisco.com/en/US/docs/cable/rf_gateway/feature/guide/
rfgw10_dtioffset.html
M-CMTS D-MPT Manual Mode—processes D-MPT traffic from the M-CMTS core.
http://www.cisco.com/en/US/docs/cable/rf_gateway/feature/guide/
rfgw10_dmpt.html
M-CMTS DEPI—
http://www.cisco.com/en/US/docs/cable/rf_gateway/feature/guide/
rfgw10_m-cmts_depi_control_plane.html
Line Card Redundancy—supports two types of line card redundancy, 1:1 and 1:N
http://www.cisco.com/en/US/docs/cable/rf_gateway/feature/guide/
rfgw10_1plsnlc.html
Configuring the Cisco RFGW-10 DS-384 Line Card
http://www.cisco.com/en/US/docs/cable/rf_gateway/linecard/ds384/configuration/guide/b_ds384_scg.html
Cisco RFGW-10 commands
Cisco RF Gateway 10 Command Reference
http://www.cisco.com/en/US/docs/cable/rf_gateway/command/reference/RFGW-10_Book.html
New Software Features in Cisco IOS Release 12.2SQ
Cisco RF Gateway 10 Software Feature and Configuration Guide
http://www.cisco.com/en/US/docs/cable/rf_gateway/feature/guide/rfgw_scg.html
Standards
Standard
Title
ITU-T J.83-B
Annex B to ITU-T Rec. J.83 (4/97), Digital multi-programme systems for television sound and data services for cable distribution.
ISO-169-24
ISO-169-24 F connector, female, indoor
DOCSIS2
Data-Over-Cable Service Interface Specifications, Radio Frequency Interface Specification v2.0, SP-RFIv2.0-I11-060602, June 2, 2006, Cable Television Laboratories, Inc.
MIBs
MIB
MIBs Link
No new or modified MIBs are supported by this feature, and support for existing MIBs has not been modified by this feature.
To locate and download MIBs for selected platforms, Cisco IOS releases, and feature sets, use Cisco MIB Locator found at the following URL:
http://www.cisco.com/go/mibs
RFCs
RFC
Title
No new or modified RFCs are supported by this feature, and support for existing RFCs has not been modified by this feature.
—
Technical Assistance
Description
Link
The Cisco Support website provides extensive online resources, including documentation and tools for troubleshooting and resolving technical issues with Cisco products and technologies.
To receive security and technical information about your products, you can subscribe to various services, such as the Product Alert Tool (accessed from Field Notices), the Cisco Technical Services Newsletter, and Really Simple Syndication (RSS) Feeds.
Access to most tools on the Cisco Support website requires a Cisco.com user ID and password.
http://www.cisco.com/cisco/web/support/index.html
Feature Information for Universal EQAM
Table 2 lists the release history for this feature.
Not all commands may be available in your Cisco IOS software release. For release information about a specific command, see the command reference documentation.
Use Cisco Feature Navigator to find information about platform support and software image support. Cisco Feature Navigator enables you to determine which Cisco IOS, Catalyst OS, and Cisco IOS XE software images support a specific software release, feature set, or platform. To access Cisco Feature Navigator, go to http://www.cisco.com/go/cfn. An account on Cisco.com is not required.
Note Table 2 lists only the Cisco IOS software release that introduced support for a given feature in a given Cisco IOS software release train. Unless noted otherwise, subsequent releases of that Cisco IOS software release train also support that feature.
  Table 2 Feature Information for DTI Client
Feature Name
Releases
Feature Information
Universal Edge Quadrature Amplitude Modulation
12.2(44)SQ
This feature was introduced in the Cisco IOS Release 12.2(44)SQ to support the Cisco RF Gateway 10.
The following commands were introduced or modified:
interface qam slot/port[.channel]
cable downstream stacking stacking
no cable downstream rf-shutdown
cable downstream Annex {A | B | C}
cable downstream tsid id
cable downstream frequency frequency
cable downstream if-output continuous-wave
cable downstream interleaver-level {1 | 2}
cable downstream interleaver-depth depth
cable downstream modulation {64qam | 256qam}
cable downstream rf-power power
cable downstream lock
show controllers qam slot/port.channel [downstream]
Glossary
dB—Decibels. Ratio of two power levels expressed mathematically as dB = 10log10(POUT/PIN)
dBmV—Decibel-Millivolt. Unit of RF power expressed in decibels relative to 1 millivolt over 75 ohms, where dBmV = 20log10(value in mV/1 mV)
FEC—Forward Error Correction. A class of methods for controlling errors in a communication system. FEC sends parity information with the data which can be used by the receiver to check and correct the data.
GHz—Gigahertz. A unit of frequency; 1,000,000,000 or 109 Hz.
Hz—Hertz. A unit of frequency; formerly cycles per second.
QAM—Quadrature Amplitude Modulation. A modulation technique in which an analog signal’s amplitude and phase vary to convey information, such as digital data.
RF—Radio Frequency. A portion of the electromagnetic spectrum from a few kilohertz to just below the frequency of infrared light.
UEQAM—Universal Edge Quadrature Amplitude Modulation. A network element, which receives MPEG-TS frames over a network interface such as Ethernet, and modulates them onto QAM carriers for use on an HFC plant.
Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. To view a list of Cisco trademarks, go to this URL: www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word partner does not imply a partnership relationship between Cisco and any other company. (1110R)
Any Internet Protocol (IP) addresses used in this document are not intended to be actual addresses. Any examples, command display output, and figures included in the document are shown for illustrative purposes only. Any use of actual IP addresses in illustrative content is unintentional and coincidental.

© 2009, 2012, 2015 Cisco Systems, Inc. All rights reserved.
Was this Document Helpful?
Yes No Feedback
Contact Cisco
Open a Support Case
(Requires a Cisco Service Contract)