Command References
Cisco IOS XE SD-WAN Qualified Command Reference
Bias-Free Language
Book Contents
Download
Print
Updated:
December 18, 2022
Chapter: Multi-Region Fabric
Chapter Contents
affinity-group (Multi-Region Fabric)
affinity-group-number
affinity-group preference (Multi-Region Fabric)
filter route outbound affinity-group preference (Multi-Region Fabric)
omp best-path region-path-length ignore (Multi-Region Fabric)
omp best-path transport-gateway (Multi-Region Fabric)
region (Multi-Region Fabric)
region access, region core (Multi-Region Fabric)
role (Multi-Region Fabric)
transport-gateway (Multi-Region Fabric)
affinity-group (Multi-Region Fabric)
Use the affinity-group command in system configuration mode to configure an affinity group for an edge router or border router. Use the no form of the command to remove the affinity group assignment.
affinity-group group-id
no affinity-group
Syntax Description
group-id
Affinity group in the range 1 to 63.
Command Default
By default, no affinity group is assigned.
Command Modes
System configuration (config-system)
Command History
Release Modification
Cisco IOS XE Release 17.8.1a
This command was introduced.
Usage Guidelines
If an affinity group has been configured previously on the device, configuring a new value replaces the previous.
Example
Configure an affinity group value of 10 on a border router.
Device#config-transaction
Device(config)#system
Device(config-system)#affinity-group 10
affinity-group-number
To assign an affinity group number to routes or TLOCs, in a Multi-Region Fabric environment, use the affinity-group-number command in configuration set mode when configuring a control policy on a Cisco SD-WAN controller. To cancel the configuration, use the no form of the command.
affinity-group-number affinity-group
no affinity-group-number affinity-group
Syntax Description
affinity-group-number affinity-group
Assign an affinity group number in the range of 0 to 63.
Command Default
There is no default.
Command Modes
configuration set (config-set)
Command History
Release Modification
Cisco IOS XE Release 17.11.1a
This command was introduced.
Example
The following example, executed on a Cisco SD-WAN controller, creates a sequence that matches routes from devices at site 100 and assigns them the affinity group 5.
vsmart# config
vsmart(config)# policy
vsmart(config-policy)# control-policy policy-1
vsmart(config-control-policy-cpolicy1)# sequence 1
vsmart(config-sequence-1)# match route
vsmart(config-match-route)# site-id 100
vsmart(config-match-route)# action accept
vsmart(config-action)# set
vsmart(config-set)# affinity-group-number 5
To configure this using a CLI template in Cisco SD-WAN Manager, use the following:
policy
 control-policy policy-1
  sequence 1
   match route
    site-id 100
  !
  action accept
   set
    affinity-group-number 5
   !
  !
 !
!
affinity-group preference (Multi-Region Fabric)
Use the affinity-group preference command in system configuration mode to configure the affinity group preference order, from highest priority to lowest priority. Use the no form of the command to remove the affinity group preference.
affinity-group preference group-id group-id | ...
no affinity-group preference
Syntax Description
group-id
Affinity group in the range 1 to 63.
Command Default
By default, no affinity group preference is assigned.
Command Modes
System configuration (config-system)
Command History
Release Modification
Cisco IOS XE Release 17.8.1a
This command was introduced.
Example
Configure a preference for affinity groups 10, 11, 20, and 5, in that order of priority.
Device#config-transaction
Device(config)#system
Device(config-system)#affinity-group preference 10 11 20 5
filter route outbound affinity-group preference (Multi-Region Fabric)
To configure a Cisco SD-WAN controller to restrict routers in the regions that it is managing to connect only to routers that are on their affinity list, use the filter route outbound affinity-group preference command in OMP configuration mode. To remove this restriction, use the no form of the command.
filter route outbound affinity-group preference
no filter route outbound affinity-group preference
Command Default
By default, there is no restriction.
Command Modes
OMP configuration (config-omp)
Command History
Release Modification
Cisco IOS XE Release 17.8.1a
This command was introduced.
Usage Guidelines
You can configure Cisco Catalyst SD-WAN to enable routers to connect only to routers that are on their affinity list. To do this, use the filter route outbound affinity-group preference command on each of the Cisco SD-WAN controllers that manage a region.
Example
vSmart#config terminal
vSmart(config)#omp
vSmart(config-omp)#filter route outbound affinity-group preference
omp best-path region-path-length ignore (Multi-Region Fabric)
To configure a device operating with Cisco Catalyst SD-WAN to enable both the primary region path and the secondary region path to a peer device, use the omp best-path region-path-length ignore command in global configuration mode. To return to the default behavior, use the no form of the command.
omp best-path region-path-length ignore
no omp best-path region-path-length ignore
Command Default
By default, the overlay management protocol (OMP) considers the path length when determining the best paths to provide to the forwarding layer.
Command Modes
Global configuration (config)
Command History
Release
Modification
Cisco IOS XE Release 17.8.1a
Added the following options for configuring secondary regions: secondary-region , secondary-shared , secondary-only
Usage Guidelines
When a direct path is available to reach a destination, by default the overlay management protocol (OMP) provides only the direct path to the routing forwarding layer because the direct path uses fewer hops. The result is that the forwarding layer, which includes application-aware policy, can only use the direct path. You can use this command to disable this comparison of the number of hops so that traffic can use either the direct secondary-region path (fewer hops) or the primary-region path (more hops). When you disable the comparison of the number of hops, OMP applies equal-cost multi-path routing (ECMP) to all routes, and packets can use all available paths.
Device(config)#omp best-path region-path-length ignore
omp best-path transport-gateway (Multi-Region Fabric)
Use the omp best-path transport-gateway command in OMP configuration mode to configure the path preference for transport gateway paths. Use the no form of the command to restore the default behavior.
omp best-path transport-gateway { ecmp-with-direct-path | prefer }
no omp best-path transport-gateway
Syntax Description
ecmp-with-direct-path
For devices that can connect through a transport gateway and through other paths, apply equal-cost multi-path (ECMP) logic to choose the best path. This is the default behavior.
prefer
For devices that can connect through a transport gateway, use only the transport gateway paths, even if other paths are available.
Command Default
ecmp-with-direct-path
Command Modes
OMP configuration (config-omp)
Command History
Release Modification
Cisco IOS XE Release 17.8.1a
This command was introduced.
Example
Device(config)#omp best-path transport-gateway prefer
region (Multi-Region Fabric)
To assign a region to a device, use the region command in system configuration mode. Use the no form of the command to remove the region assignment.
region region-id subregion subregion-id
no region
Syntax Description
region region-id
Assign a region in the range of 1 to 63.
subregion subregion-id
Assign a subregion in the range of 1 to 63.
Command Default
The command has no default.
Command Modes
System configuration
Command History
Release Modification
Cisco IOS XE Release 17.7.x
This command was introduced.
Cisco IOS XE Release 17.10.1a
Added the subregion option.
Usage Guidelines
Example
The following example configures a device to region 1, subregion 5.
system
 system-ip 192.0.2.1
 domain-id 1
 site-id 1100
 region 1
  subregion 5
region access, region core (Multi-Region Fabric)
To configure a border router in a Multi-Region Fabric environment that is performing route aggregation to advertise the routes specifically to the core region or access region, use the region access or region core commands in VRF configuration mode. To cancel the configuration, use the no form of the command. For a border router performing route aggregation, we recommend configuring either region core or region access.
advertise aggregate prefix aggregate-only region { access | core }
no advertise aggregate prefix [ aggregate-only ] region { access | core }
Syntax Description
aggregate-only
Use aggregate-only to advertise only the aggregate prefix and not the component routes included within the range of the prefix.
region {access | core}
When using route aggregation on a border router, advertise aggregated routes to the access region or to the core region. If you do not specify the region, the border router advertises the aggregated routes both to the access region that it serves and to the core region.
Command Default
The command has no default.
Command Modes
VRF configuration (config-vrf-vrf-number)
Command History
Release Modification
Cisco IOS XE Release 17.11.1a
This command was introduced.
Example
The following example, executed on a border router in a Multi-Region Fabric environment, advertises aggregation of routes defined by the 10.0.0.0/8 prefix. The border router advertises the routes to its peers in the core region. This is useful for aggregating routes for access region devices in the 10.0.0.0/8 range to reduce the number of routes that must be advertised in the core region.
Device#config-transaction
admin connected from 127.0.0.1 using console on vm11
Device(config)#sdwan omp
Device(config-omp)#address-family ipv4 vrf 1
Device(config-vrf-1)#advertise aggregate 10.0.0.0/8 region core
The following example, executed on a border router in a Multi-Region Fabric environment, advertises aggregation of routes defined by the 10.0.0.0/8 prefix. The border router advertises the routes to its peers in the access region. This is useful for aggregating routes for core region devices in the 10.0.0.0/8 range to reduce the number of routes that must be advertised in the access region.
Device#config-transaction
admin connected from 127.0.0.1 using console on vm11
Device(config)#sdwan omp
Device(config-omp)#address-family ipv4 vrf 1
Device(config-vrf-1)#advertise aggregate 10.0.0.0/8 region access
role (Multi-Region Fabric)
To configure a device role as border router for Multi-Region Fabric, use the role command in system configuration mode. To configure a device to the default edge router mode, use the no form of this command.
role border-router
no role
Syntax Description
border-router
Configure the device role as border router.
Command Modes
System configuration (config-system)
Command History
Release
Modification
Cisco IOS XE Release 17.7.1a
Command qualified for use in Cisco SD-WAN Manager CLI templates.
Usage Guidelines
The command does not have an option for setting the role to edge router. The default role is edge router, so you can use the no form of the command to configure the device role as edge router.
Configure a device role as border router.
Device(config)#system
Device(config-system)#role border-router
Configure a device role as edge router.
Device(config)#system
Device(config-system)#no role
transport-gateway (Multi-Region Fabric)
Use the transport-gateway command in system configuration mode to enable transport gateway functionality on a device. Use the no form of the command to disable this functionality.
transport-gateway enable
no transport-gateway enable
Command Default
By default, transport gateway functionality is disabled.
Command Modes
System configuration mode (config-system)
Command History
Release Modification
Cisco IOS XE Release 17.8.1a
This command was introduced.
Example
Device(config-system)#transport-gateway enable
Was this Document Helpful?
Yes No
Feedback
Contact Cisco
Open a Support Case
(Requires a Cisco Service Contract)