Configuration Guides
Unset Boot Parameter ROMMON Variable on Cisco Supervisor Engine 7-E Using IOS Command Line Interface
Save
Download
Print

Updated:September 29, 2017
Bias-Free Language
Contents
Unsetting the Boot Parameter Using IOS Command Line Interface
Unsetting the Boot Parameter Using IOS Command Line Interface
Effective with Cisco IOS-XE 3.2.3SQ, platform environment variables such as BootParam can be modified from the IOS Command Line Interface. This procedure can be performed using Telnet or Management IP, which is a convenient way to modify the variables.
The following are the boot parameter variables available:
BootParam1
BootParam2
BootParam3
BootParam4
BootMode
Important:
You must perform this procedure on both active and standby Supervisor Engine 7-E card because this procedure is applicable only for the active Supervisor Engine 7-E. Hence you need to repeat this procedure on the standby Supervisor Engine 7-E card as well.
Before You Begin
Ensure that you have access to Cisco RF Gateway 10 Supervisor Engine 7-E through Management IP.
Procedure
  Command or Action Purpose
Step 1 enable


Example:
RFGW-10> enable
  Enables privileged EXEC mode.
  Step 2 show platform environment variables


Example:
RFGW-10# show platform environment variables 
  Verify if boot parameter variables and BootMode environment variables are set.
The following is displayed if the boot parameter variables are set:
BootParam1="ip=::::nova:eth0:off rw disableautoreboot"
BootParam2="BootMode=0"
BootMode="0"
  Step 3 platform environment variables unset BootParamvariable


Example:
RFGW-10# platform environment variables unset BootParam1 
RFGW-10# platform environment variables unset BootParam2
RFGW-10# platform environment variables unset BootParam3
RFGW-10# platform environment variables unset BootParam4
  Unset the boot parameter variables.
BootParamvariable - The boot parameter variables. The following are the boot Parameter variables available:
BootParam1
BootParam2
BootParam3
BootParam4
BootMode
Note    Skip this step, if boot parameter variables are not set.
  Step 4 show platform environment variables


Example:
RFGW-10# show platform environment variables 
  Verify if the boot parameter variables are now unset.
  Step 5 reload


Example:
RFGW-10# reload 
  Reload the SUP7.
Note    Reload ensures that the boot parameter variables are unset.
  The following is the example of the show platform environment variables command, if boot parameter variables are set.
PS1="rommon ! >"
SupportedFeatures="1"
SkipDiagsAlways="1"
CodeSignDisable="1"
BootParam1="ip=:::va:eth0:off rw disableautoreboot"
BootParam2="BootMode=0"
ConfigReg="0x2102"
DiagMonitorAction="Normal"
RommonVer="15.0(1r)SQ(315)"
BOOT="slot0:rfgwk10-entservicesk9.03.03.01.SQ.150-2.SQB1.bin,12;bootflash:rfgwk10-entservicesk9.03.02.00.SQ.150-2.SQA.bin,12;"
RET_2_RTS="01:07:15 EST Tue Feb 4 2014"
BootedFileName="slot0:rfgwk10-entservicesk9.03.03.01.SQ.150-2.SQB1.bin"
ReqClearAutoboot="1"
BootStatus="Success"
RET_2_RCALTS=""
The following is the example of the show platform environment variables command if boot parameter variables are unset.
PS1="rommon ! >"
SupportedFeatures="1"
SkipDiagsAlways="1"
CodeSignDisable="1"
ConfigReg="0x2102"
DiagMonitorAction="Normal"
RommonVer="15.0(1r)SQ(315)"
BOOT="slot0:rfgwk10-entservicesk9.03.03.01.SQ.150-2.SQB1.bin,12;bootflash:rfgwk10-entservicesk9.03.02.00.SQ.150-2.SQA.bin,12;"
RET_2_RTS="01:07:15 EST Tue Feb 4 2014"
BootedFileName="slot0:rfgwk10-entservicesk9.03.03.01.SQ.150-2.SQB1.bin"
ReqClearAutoboot="1"
BootStatus="Success"
RET_2_RCALTS=""
What to Do Next
This procedure unsets the boot parameter on a single Supervisor Engine 7-E card. So repeat this procedure on the other Supervisor Engine 7-E card.
Was this Document Helpful?
Yes No Feedback
Contact Cisco
Open a Support Case
(Requires a Cisco Service Contract)