Command References
Cisco IOS XE SD-WAN Qualified Command Reference
Bias-Free Language
Book Contents
Download
Print
Updated:
January 29, 2021
Chapter: TCP Commands
Chapter Contents
service tcp-keepalives-in
service tcp-keepalives-out
service tcp-small-servers
service udp-small-servers
service tcp-keepalives-in
To generate keepalive packets on idle incoming network connections (initiated by the remote host), use the service tcp-keepalives-in command in global configuration mode . To disable the keepalives, use the no form of this command.
service tcp-keepalives-in
no service tcp-keepalives-in
Syntax Description
This command has no arguments or keywords.
Command Default
Disabled
Command Modes
Global configuration
Command History
Release
Modification
Cisco IOS XE Release 17.3.1a
Command qualified for use in Cisco vManage CLI templates.
In the following example, keepalives on incoming TCP connections are generated:
Device(config)# service tcp-keepalives-in
 
service tcp-keepalives-out
To generate keepalive packets on idle outgoing network connections (initiated by a user), use the service tcp-keepalives-out command in global configuration mode . To disable the keepalives, use the no form of this command.
service tcp-keepalives-out
no service tcp-keepalives-out
Syntax Description
This command has no arguments or keywords.
Command Default
Disabled
Command Modes
Global configuration
Command History
Release
Modification
Cisco IOS XE Release 17.3.1a
Command qualified for use in Cisco vManage CLI templates.
In the following example, keepalives on outgoing TCP connections are generated:
Device(config)# service tcp-keepalives-out
 
service tcp-small-servers
To enable small TCP servers such as the Echo, use the service tcp-small-servers command in global configuration mode. To disable the TCP server, use the no form of this command.
service tcp-small-servers
no service tcp-small-servers
Command Default
TCP small servers are disabled.
Command Modes
Global configuration (config)
Command History
Release
Modification
Cisco IOS XE Release 17.3.1a
Command qualified for use in Cisco vManage CLI templates.
Usage Guidelines
For usage guidelines, see the Cisco IOS XE service tcp small servers command.
The following example shows how to enable small TCP servers:
Device(config)# service tcp-small-servers
service udp-small-servers
To enable small User Datagram Protocol (UDP) servers such as the Echo, use the service udp-small-servers command in global configuration mode. To disable the UDP server, use the no form of this command.
service udp-small-servers
no service udp-small-servers
Command Default
UDP small servers are disabled.
Command Modes
Global configuration (config)
Command History
Release
Modification
Cisco IOS XE Release 17.3.1a
Command qualified for use in Cisco vManage CLI templates.
Usage Guidelines
For usage guidelines, see the Cisco IOS XE service udp small servers command.
The following example shows how to enable small UDP:
Router(config)# service udp-small-servers
Was this Document Helpful?
Yes No
Feedback
Contact Cisco
Open a Support Case
(Requires a Cisco Service Contract)